{ "points-of-interest":
    [
     {"name":"Camp Nou",
     "description":"Camp Nou is a football stadium in Barcelona, Catalonia, Spain, which has been the home of Futbol Club Barcelona since 1957. The Camp Nou holds 99,786 people, and thus is the largest stadium in Europe and the 4th largest association football stadium in the world in terms of capacity. It has hosted numerous international matches at a senior level, including two UEFA Champions League finals and the football competition at the 1992 Summer Olympics.\n\nThe construction of Camp Nou started on 28 March 1954 as Barcelona's previous stadium, Camp de Les Corts, had no room for expansion. Although originally planned to be called Estadi del FC Barcelona, the more popular name Camp Nou was used. The June 1950 signing of László Kubala, regarded as one of Barcelona's greatest players, provided further impetus to the construction of a larger stadium.\n\nConstruction of Camp Nou began on 28 March 1954 before a crowd of 60,000 Barça fans. The civil governor of Barcelona, Felipe Acedo Colunga, presided at the laying in place of the first stone, with a blessing from the Archbishop of Barcelona, Gregorio Modrego. Construction took three years, going 336% over budget for a final cost of 288 million pesetas. The stadium was officially opened on 24 September 1957. Handel's Messiah was performed at the opening of the stadium. Barcelona then defeated Legia Warsaw 4-2 in a friendly match.\n\nThe architects were a team made up of Francesc Mitjans, Josep Soteras, and Lorenzo García-Barbón.\n\nThe stadium’s capacity has varied greatly over the years, opening at 106,146, but growing to 121,749 for the 1982 FIFA World Cup.\n\nApart from hosting FC Barcelona, Camp Nou is home turf to the Catalan national team, their latest match as of August 2010 being a 4–2 win over Argentina. The stadium is frequently used for other football events. The European Cup final between Milan and Steaua Bucureşti was held on 24 May 1989, with the Italian club winning 4–0. Camp Nou hosted part of the football competition, including the final, in the 1992 Summer Olympics. In preparation for these Games, two additional tiers of seating were installed over the previous roof-line.\n\nCamp Nou underwent little change after 1982, except for the opening of the club museum in 1984. The stadium underwent a facelift in 1993–94, in which the pitch was lowered by 2.5 m (8 ft), the security gap that separated the lawn from the galleries was removed, and standing room was eliminated in favor of individual seating. A new press box, renovation of the presidential grandstand and boxes, new parking under the main grandstand, and new lighting and sound systems were completed in time for the 1998–99 season. In 1999 the UEFA outlawed standing sections in stadiums, and Camp Nou’s capacity settled to its current level. The stadium hosted the 1999 UEFA Champions League Final later that year where Manchester United played Bayern Munich. United won 2–1, coming back from 0–1 down in injury time.\n\nDuring 1998–99, UEFA rated Camp Nou a five-star stadium for its services and functionalities. However, as per the 2010 regulations, UEFA does not publish a list of the top venues.\n\nIn 2000, fans were polled concerning the stadium’s name. Of the 29,102 votes the club received, a total of 19,861 (68.25%) preferred Camp Nou to Estadi del FC Barcelona, and thus the official name was changed to the popular nickname.\n\nThe facilities now include a memorabilia shop, mini-pitches for training matches, and a chapel for the players. The stadium also houses the second-most visited museum in Catalonia, FC Barcelona Museum, which receives more than 1.2 million visitors per year.",
     "street":"Carrer d'Aristides Maillol, 12, 08028, Barcelona",
     "latitude":41.38089054229531,
     "longitude":2.122862304260252,
     "foto-peq":"campNouSmall.jpg",
     "foto-gran":"campNouBig.jpg",
     "color":"white",
     "squareX":60.0,
     "squareY":0.0,
     "offset":175.0
     },
     {"name":"Park Güell",
     "description":"The Park Güell is a public park system composed of gardens and architectonic elements located on Carmel Hill, in Barcelona (Spain). Carmel Hill belongs to the mountain range of Collserola — the Parc del Carmel is located on the northern face. Park Güell is located in La Salut, a neighborhood in the Gràcia district of Barcelona. With urbanization in mind, Eusebi Güell assigned the design of the park to Antoni Gaudí, a renowned architect and the face of Catalan modernism. The park was built between 1900 and 1914 and was officially opened as a public park in 1926. In 1984, UNESCO declared the park a World Heritage Site under “Works of Antoni Gaudí”.\n\nPark Güell is the reflexion of Gaudí’s artistic plenitude, which belongs to his naturalist phase (first decade of the 20th century). During this period, the architect perfected his personal style through inspiration from organic shapes found in nature. He put into practice a series of new structural solutions rooted in the deep analysis of geometry and its shapes. To that, the Catalan artist adds creative liberty and an imaginative, ornamental creation. Starting from a sort of baroquism, his works acquire a structural richness of forms and volumes, free of the rational rigidity or any sort of classic premisses. In the design of Park Güell, Gaudí unleashed all his architectonic genius and put to practice much of his innovative structural solutions that would become the symbol of his organic style and that would culminate in the creation of the Basilica and Expiatory Church of the Holy Family (Catalan: Sagrada Familia).\n\nGüell and Gaudí conceived this park, situated within a natural park of incomparable beauty. They imagined an organized grouping of high-quality homes, decked out with all the latest technological advancements to ensure maximum comfort, finished off with an artistic touch. They also envisioned a community strongly influenced by symbolism, since, in the common elements of the park, they were trying to synthesize many of the political and religious ideals shared by patron and architect: therefore there are noticeable concepts originating from political Catalanism - especially in the entrance stairway where the Catalonian countries are represented - and from Catholicism - the Monumento al Calvario, originally designed to be a chapel. The mythological elements are so important: apparently Güell and Gaudí's conception of the park was also inspired by the Temple of Apollo of Delfos.\n\nOn the other hand, many experts have tried to link the park to various symbols because of the complex iconography that Gaudí applied to the urban project. Such references go from political vindication to religious exaltation, passing through mythology, history and philosophy. Specifically, many studies claim to see references to Freemasonry, which is highly unlikely due to the deep religious beliefs of both Gaudí and Count Güell, nor have these references been proven in the historiography of the modern architect. The multiplicity of symbols found in the Park Güell is, as previously mentioned, associated to political and religious signs, with a touch of mystery according to the preferences of that time for enigmas and puzzles.",
     "street":"Carrer d'Olot, s/n, 08024, Barcelona",
     "latitude":41.41418905038741,
     "longitude":2.1527159576721715,
     "foto-peq":"parcGuellSmall.jpeg",
     "foto-gran":"parcGuellBig.jpg",
     "color":"white",
     "squareX":10.0,
     "squareY":0.0,
     "offset":140.0
     },
     {"name":"La Pedrera",
     "description":"Casa Milà, also known as La Pedrera, is a modernist building located at 92, Passeig de Gràcia in Barcelona, Catalonia, Spain, at the corner of Carrer de Provença, in the Eixample. It was the last civil work designed by Catalan architect Antoni Gaudí and it was built between the years 1906 and 1910.\n\nIt was commissioned in 1912 by businessman Pere Milà i Camps and his wife Roser Segimon i Artells, from Reus and widow of the wealthy Indian Josep Guardiola i Grau. At the time it was very controversial because of the bold undulating stone facade and twisted wrought iron that decorate the balconies and windows, designed mostly by Josep Maria Jujol, who also designed some of the skies of plaster.\n\nArchitecturally it is considered an innovative work by having a structure of columns and floors free of load bearing walls. Similarly, the front – which is made of stone – is also self-supporting, i.e., not loads of floors. Another innovative element was the construction of the underground garage.\n\nIn 1984, it was declared a World Heritage Site by UNESCO. It is currently the headquarters of the Fundació-Catalunya La Pedrera, which manages the various exhibitions and activities done there and the public visits.\n\nCasa Milà was built for the married couple, Roser Segimon and Pere Milà. Roser Segimon was the wealthy widow of Josep Guardiola, an Indiano, a term applied to the Spaniards returning from the American colonies with tremendous wealth. Her second husband, Pere Milà, was a developer who was criticized for his flamboyant lifestyle and ridiculed by the contemporary residents of Barcelona, when they joked about his love of money and opulence, wondering if he was not rather more interested in “the widow’s guardiola” (piggy bank), than in “Guardiola’s widow”.\n\nPere Milà i Camps was a businessman, interested in arts and entertainment, owner of the Plaza de Toros Monumental, and would eventually enter politics. From a bourgeois family, snobbish and quite rich, especially because of his marriage to Roser Segimon i Artells. Milan wanted to stand out from the bourgeoisie of Barcelona, and this happened as he lived on Passeig de Gràcia in a fashionable building. While visiting his father's partner in the hemp business, Josep Batlló, during construction of the Casa Batlló, he met Gaudí and assured him that Gaudí's next work would be specially for him.\n\nThe building is 1,323 m2 per floor on a plot of 1,620 m2. Gaudí began the first sketches in his workshop in the Sagrada Familia, where he conceived of this house as a constant curve, both outside and inside, incorporating multiple solutions of formal geometry and elements of a naturalistic nature.\n\nCasa Milà is the result of two buildings, which are structured around two courtyards that provide light to the nine levels: basement, ground floor, mezzanine, main (or noble) floor, four upper floors, and an attic. The basement was intended to be the garage, the main floor the residence of the Milàs (a flat of all 1,323 m2), and the rest distributed over 20 homes for rent. The resulting layout is shaped like an asymmetrical “8” because of the different shape and size of the courtyards. The attic housed the laundry and drying areas, forming an insulating space for the building and simultaneously determining the levels of the roof.\n\nOne of the most significant parts of the building is the roof, crowned with skylights or staircase exits, fans, and chimneys. All of these elements, constructed with timbrel coated with limestone, broken marble or glass, have a specific architectural function, nevertheless, they have become real sculptures integrated into the building.\n\nThe building is a unique entity, where the shape of the exterior continues to the interior. The apartments feature ceilings with plaster reliefs of great dynamism, handcrafted wooden doors, windows, and furniture (sadly, now gone), and the design of the hydraulic pavement and different ornamental elements.\n\nThe stairways were intended for services, in that access to housing was by elevator except for the noble floor, where Gaudí added a staircase of a particular configuration.\n\nGaudi wanted the people who lived in the flats to all know each other. Therefore there were only lifts on every second floor so people had to communicate with one another on different floors.",
     "street":"Provença, 261-265, 08008, Barcelona",
     "latitude":41.395324161240616,
     "longitude":2.161897026983638,
     "foto-peq":"laPedreraSmall.jpeg",
     "foto-gran":"laPedreraBig.jpg",
     "color":"black",
     "squareX":10.0,
     "squareY":0.0,
     "offset":175.0
     },
     {"name":"Casa Batlló",
     "description":"Gaudí architectural treasure\n\nCasa Batlló, built between 1904 and 1906 in the heart of the city, is the most emblematic work of the brilliant Catalan architect.\n\nGaudí gave Casa Batlló a facade that is original, fantastical and full of imagination. He replaced the original facade with a new composition of stone and glass. He ordered the external walls to be redesigned to give them a wavy shape, which was then plastered with lime mortar and covered with a mosaic of fragments of coloured glass and ceramic discs.\n\nAt the top of the facade, the roof is in the shape of an animal’s back with large iridescent scales. The spine which forms the ornamental top is composed of huge spherical pieces of masonry in colours which change as you move along the roof-tree from one end to the other.\n\nThe long gallery of the main suite, the Noble Floor, overlooking Passeig de Gràcia, is composed of wooden-framed windows which are opened and closed by raising and lowering using counterweights. They are unusual in that there are no jambs or mullions, so that it is possible to raise all of the window panes and have a continuous panoramic opening running the full width of the room.\n\nOn the level of the ground floor, the Noble Floor and the first floor, the facade includes slender pillars of Montjuic stone which form bone-like shapes and are decorated with typically modernist floral designs.\n\nThe balcony railings in the shape of masks are made of wrought iron cast in a single piece and are secured by two anchor points in such a way that the balconies partly project outwards.\n\nAs a whole, the facade is a joyful and allegorical representation, full of organic elements and colours and charged with symbolism, a wonderful spectacle in the city which inspires the most sublime sentiments in all those who gaze upon it. The house is a dialogue between light and colour.\n\nOn the Noble Floor, which was the residence of the Batlló family, Gaudí created a new layout with undulating internal walls, and he decorated the various rooms.\n\nFrom the entrance hall on the ground floor, a sturdy iron railing separates the private access to the Batlló family residence. A grand wooden staircase leads up from a hall with vaulted ceilings and skylights shaped like tortoises’ shells. The spine of some huge animal carved from fine hardwood rises up as a banister through impossible spaces, giving the whole space an underwater atmosphere, transporting visitors to the fantasy world of Jules Verne. Here, the idea of the depths of the sea is very believable, with colours and shades of the surface of the sea and sand, and other marine allusions.\n\nThe family dwelling has its own courtyard in the centre of the block, accessed through the dining room, in the most private area of the house.\n\nOverlooking Passeig de Gràcia is the main suite of the house, which is composed of a central room and two smaller side rooms which can be joined together to form a spacious open-plan area in the style of modern lofts. The central area includes the large gallery mentioned above, which projects out over the street.\n\nThe building well is an extremely important part of the refurbishment. Gaudí enlarged the light well and covered the walls entirely in relief glazed tiles in varying shades of blue, which are darker in colour at the top and lighter towards the bottom, thus achieving an even distribution of the light. The windows are smaller higher up where more natural light can enter, whereas they get larger as you move further down. Below the windows there are wooden slits which can be opened and closed to ensure good ventilation. In the middle of the light well he installed the lift, with its fine original wooden cabin which still functions today.\n\nThe vast central skylight is composed of huge pieces of iron and glass panes, and it spans the large building well which was widened by Gaudí. It is this huge skylight that allows a cascade of light to enter and illuminate the whole building well.\n\nCasa Batlló is a masterpiece of shape, colour and light. In this work, Gaudí is pre-empting the theory of rationalism, which would come 30 years later, with its modern notion of ventilation.\n\nThe work as a whole is a marvel of ornamental design thanks to its use of emerging trades. Gaudí worked with the most highly skilled craftsmen in every profession. The transformation of wrought iron, in which curves are not only for rhetorical and aesthetic purposes, but also provide structural support; undulating works in wood such as three-dimensional doors with surprising embossed patterns; colourful stained-glass windows which filter the natural light; raised ceramic tiles; decorative pieces of masonry made from Montjuic sandstone: all of these elements are testament to the skill of the craftsmen of the period.\n\nThe loft, which is an area of well-ventilated sweeping spaces reminiscent of Mediterranean architecture, stands out on account of its arrangement of arches. From the main room of the loft, visitors can observe Gaudí’s wonderful and organic world. In it, you can appreciate the structure of ribs and breastbone which create the parabolic arches, the latest in modernist design, which support the roof terrace. The spiral stairs leading to the roof terrace, with their structural minimalism, are also very striking. The iron handrail, with its simple lines, is a 20th century sculpture in its own right.\n\nOn the flat roof, the prominence of the dragon’s back, which is so important to the overall artistic equilibrium of the facade, gives way to the four groups of graceful chimneys. Behind the aesthetic aspect, functionality is ever-present: the wind cannot obstruct smoke from escaping thanks to the chimney caps on the tops of the chimneys, which are tiled with the same trencadís glazed mosaics as the facade. Gaudí covered the curved surfaces with cut tiles, in the style of the Byzantine builders.\n\nMoving through the house, visitors are constantly surprised by the details which they discover with every step. The doors of each apartment are labelled in a modernist script specially designed by Gaudí for Casa Batlló. The massive windows on the landings of the communal stairwell, which are translucent rather than transparent, allow light to pass through selectively, while at the same time, depending on how you look at them, distort the shades of blue of the building well into beautiful waves of the sea. The shapes of the door handles, banisters, skylights, etc., are all ergonomically designed. It is the definitive work of art, with the artist encouraging everything to work together: design, space, colour, shape and light.\n\nThe building consists of a ground floor, a main floor with a courtyard, four further self-contained floors, a loft and a roof terrace. There is private access to the noble floor (the main floor), and a communal stairwell set within the building well which has been expanded and artistically tiled as though it were part of the exterior facade. The Coach Houses are accessed from the street, at street level, and these occupy the area below the courtyard of the Noble Floor, and from here you gain access to the Coal Cellars below.\n\nIn total, the house has a surface area of more than 5,000 m². The front of the building looks out onto Passeig de Gràcia, and the back faces the inner courtyard of the building.",
     "street":"Passeig de Gràcia, 43, 08007, Barcelona",
     "latitude":41.39154421368322,
     "longitude":2.164888757672088,
     "foto-peq":"casaBatlloSmall.jpeg",
     "foto-gran":"casaBatlloBig.jpg",
     "color":"white",
     "squareX":5.0,
     "squareY":0.0,
     "offset":125.0
     },
     {"name":"Casa Amatller",
     "description":"Casa Amatller is a building in the Modernisme style in Barcelona, designed by Josep Puig i Cadafalch. Along with Casa Batlló and Casa Lleó-Morera, it makes up the three most important buildings in Barcelona's famous Illa de la Discòrdia (“Block of Discord”), noted for its unique modernist buildings.\n\nThe building was originally designed as a residence for chocolatier Antoni Amatller and was constructed between 1898 and 1900.",
     "street":"Passeig de Gràcia, 41, 08007, Barcelona",
     "latitude":41.39150396934221,
     "longitude":2.16509260555722,
     "foto-peq":"casaAmatSmall.jpeg",
     "foto-gran":"casaAmatBig.jpg",
     "color":"black",
     "squareX":5.0,
     "squareY":0.0,
     "offset":0.0
     },
     {"name":"Palau de la Música",
     "description":"The Palau de la Música Catalana, is a concert hall in Barcelona, Spain. Designed in the Catalan modernista style by the architect Lluís Domènech i Montaner, it was built between 1905 and 1908 for the Orfeó Català, a choral society founded in 1891 that was a leading force in the Catalan cultural movement that came to be known as the Renaixença (Catalan Rebirth). It was inaugurated February 9, 1908.\n\nThe project was financed primarily by the society, but important financial contributions also were made by Barcelona's wealthy industrialists and bourgeoisie. The Palau won the architect an award from the Barcelona City Council in 1909, given to the best building built during the previous year. Between 1982 and 1989, the building underwent extensive restoration, remodeling, and extension under the direction of architects Oscar Tusquets and Carles Díaz. In 1997, the Palau de la Música Catalana was declared a UNESCO World Heritage Site along with Hospital de Sant Pau. Today, more than half a million people a year attend musical performances in the Palau that range from symphonic and chamber music to jazz and Cançó (Catalan song).\n\nThe Palau is located on a cramped street, the Carrer de Sant Francesc de Paula, in the section of old Barcelona known as La Ribera. It stands out there not only because it is such an exuberant building but also because the buildings that surround it are rather dull. Most of the other prominent modernista buildings, those designed by Antoni Gaudí, for example, are located in the chic 19th-century extension of the city known as the Eixample.\n\nThe design of the Palau is typical of Catalan modernism in that curves predominate over straight lines, dynamic shapes are preferred over static forms, and rich decoration that emphasizes floral and other organic motifs is used extensively. In contrast to many other buildings built in the modernisme style, however, it must also be said that the design of the Palau is eminently rational. It pays strict attention to function and makes full use of the most up-to-date materials and technologies available at the beginning of the 20th century (e.g., steel framing). As Benton (1986, 58) has pointed out, “To eyes unaccustomed to the architecture of Barcelona, the impression of a riot of ornament lacking any logic or control seems overwhelming. And yet the building follows exactly the exhortations of the architectural rationalists. The structure, in brick and iron, is clearly expressed.” Actually, its walls are the first example of curtain wall structures.\n\nThe wealthy citizens of Barcelona, who were becoming ever more sympathetic to the Renaixença at the time the Palau was built, asked its architect for building materials and techniques that symbolized the Catalan character. In response, he commissioned and gave great creative freedom to a variety of local artisans and craftsmen to produce the fabulous ornamentation, sculpture, and decorative structural elements for which the Palau is famous.",
     "street":"Carrer Palau de la Música, 4-6, 08003, Barcelona",
     "latitude":41.38755325971482,
     "longitude":2.1753297748687146,
     "foto-peq":"palauMusicaSmall.jpeg",
     "foto-gran":"palauMusicaBig.jpg",
     "color":"white",
     "squareX":35.0,
     "squareY":0.0,
     "offset":125.0
     },
     {"name":"Sagrada Familia",
     "description":"The Basílica i Temple Expiatori de la Sagrada Família, is a large Roman Catholic church in Barcelona, Spain, designed by Catalan architect Antoni Gaudí (1852–1926). Although incomplete, the church is a UNESCO World Heritage Site, and in November 2010 Pope Benedict XVI consecrated and proclaimed it a minor basilica, as distinct from a cathedral which must be the seat of a bishop.\n\nConstruction of Sagrada Família had commenced in 1882 and Gaudí became involved in 1883, taking over the project and transforming it with his architectural and engineering style, combining Gothic and curvilinear Art Nouveau forms. Gaudí devoted his last years to the project, and at the time of his death at age 73 in 1926 less than a quarter of the project was complete. Sagrada Família's construction progressed slowly, as it relied on private donations and was interrupted by the Spanish Civil War, only to resume intermittent progress in the 1950s. Construction passed the midpoint in 2010 with some of the project's greatest challenges remaining and an anticipated completion date of 2026, the centenary of Gaudí's death.\n\nThe basílica has a long history of dividing the citizens of Barcelona: over the initial possibility it might compete with Barcelona's cathedral, over Gaudí's design itself, over the possibility that work after Gaudí's death disregarded his design, and the recent proposal to build an underground tunnel of Spain's high-speed rail link to France which could disturb its stability. Describing Sagrada Família, art critic Rainer Zerbst said, “It is probably impossible to find a church building anything like it in the entire history of art” and Paul Goldberger called it, “The most extraordinary personal interpretation of Gothic architecture since the Middle Ages.”\n\nThe church shares its site with the Sagrada Família Schools building, a school originally designed by Gaudí in 1909 for the children of the construction workers. Relocated in 2002 from the eastern corner of the site to the southern corner, the building now houses an exhibition.\n\nThe Basilica of the Sagrada Família was the inspiration of a bookseller, Josep Maria Bocabella, founder of Asociación Espiritual de Devotos de San José (Spiritual Association of Devotees of St. Joseph). After a visit to the Vatican in 1872, Bocabella returned from Italy with the intention of building a church inspired by that at Loreto. The apse crypt of the church, funded by donations, was begun 19 March 1882, on the festival of St. Joseph, to the design of the architect Francisco de Paula del Villar, whose plan was for a Gothic revival church of a standard form. The apse crypt was completed before Villar's resignation on 18 March 1883, when Gaudí assumed responsibility for its design, which he changed radically. Antoni Gaudí began work on the church in 1883 but was not appointed Architect Director until 1884.\n\nOn the subject of the extremely long construction period, Gaudí is said to have remarked: “My client is not in a hurry”. When Gaudí died in 1926, the basilica was between 15 and 25 percent complete. After Gaudí's death, work continued under the direction of Domènec Sugrañes i Gras until interrupted by the Spanish Civil War in 1936. Parts of the unfinished basilica and Gaudí's models and workshop were destroyed during the war by Catalan anarchists. The present design is based on reconstructed versions of the plans that were burned in a fire as well as on modern adaptations. Since 1940 the architects Francesc Quintana, Isidre Puig Boada, Lluís Bonet i Gari and Francesc Cardoner have carried on the work. The illumination was designed by Carles Buigas. The current director and son of Lluís Bonet, Jordi Bonet i Armengol, has been introducing computers into the design and construction process since the 1980s. Mark Burry of New Zealand serves as Executive Architect and Researcher. Sculptures by J. Busquets, Etsuro Sotoo and the controversial Josep Subirachs decorate the fantastical façades.\n\nThe central nave vaulting was completed in 2000 and the main tasks since then have been the construction of the transept vaults and apse. As of 2006, work concentrated on the crossing and supporting structure for the main tower of Jesus Christ as well as the southern enclosure of the central nave, which will become the Glory façade.\n\nOne projection anticipates construction completion around 2026, the centennial of Gaudí's death—while the project's information leaflet estimates a completion date in 2028, accelerated by additional funding from visitors to Barcelona following the 1992 Barcelona Olympics.\n\nComputer-aided design technology has been used to accelerate construction of the building, which had previously been expected to last for several hundred years, based on building techniques available in the early 20th century. Current technology allows stone to be shaped off-site by a CNC milling machine, whereas in the 20th century, the stone was carved by hand.\n\nIn 2008, some renowned Catalan architects advocated a halt to construction, to respect Gaudí's original designs, which, although they were not exhaustive and were partially destroyed, have been partially reconstructed in recent years.\n\nA 2010 exhibition, Gaudí Unseen, Completing La Sagrada Família at the German Architecture Museum, Frankfurt am Main, describes the current construction methods and future plans for the Sagrada Família.",
     "street":"Carrer de Mallorca, 401, 08013, Barcelona",
     "latitude":41.40361504211753,
     "longitude":2.1743497711639748,
     "foto-peq":"sagradaFamSmall.jpeg",
     "foto-gran":"sagradaFamBig.jpg",
     "color":"white",
     "squareX":0.0,
     "squareY":0.0,
     "offset":125.0
     },
     {"name":"Mercat de la Boqueria",
     "description":"The Mercat de Sant Josep de la Boqueria, often simply referred to as La Boqueria, is a large public market in the Ciutat Vella district of Barcelona, Catalonia, Spain and one of the city's foremost tourist landmarks, with an entrance from La Rambla, not far from the Liceu, Barcelona's opera house. The market has a very diverse selection of goods.\n\nThe first mention of the Boqueria market in Barcelona dates from 1217, when tables were installed near the old city gate to sell meat. From December 1470 onwards, a pig market was held at this site; at this time it was known as Mercat Bornet. Later, until 1794, it was known simply as Mercat de la Palla, or straw market. In the beginning, the market was not enclosed and had no official status, being regarded simply as an extension of the Plaça Nova market, which extended to the Plaça del Pi.\n\nLater, the authorities decided to construct a separate market on La Rambla, housing mainly fishmongers and butchers. It was not until 1826 that the market was legally recognized, and a convention held in 1835 decided to build an official structure. Construction began on March 19, 1840 under the direction of the architect Mas Vilà. The market officially opened in the same year, but the plans for the building were modified many times. The inauguration of the structure finally took place in 1853. A new fish market opened in 1911, and the metal roof that still exists today was constructed in 1914.",
     "street":"La Rambla, 91, 08001, Barcelona",
     "latitude":41.38176980080768,
     "longitude":2.1716632183853335,
     "foto-peq":"boqueriaSmall.jpeg",
     "foto-gran":"boqueriaBig.jpg",
     "color":"white",
     "squareX":0.0,
     "squareY":0.0,
     "offset":225.0
     },
     {"name":"Centre Cultural del Born",
     "description":"Mercat del Born is a former public market and one of the most important buildings in Barcelona, Catalonia, Spain constructed with iron. Located in the lower, east side of the la Ribera neighborhood, it is the largest covered square in all of Europe and marked the start of Modernisme in Catalan architecture.\n\nThe market is rectangular, with two large domed, intersecting buildings, and 4 smaller naves. The structure is supported on cast iron columns with a flat roof covered in glazed tile.\n\nIt was designed in 1873 by the municipal architect Antoni Rovira i Trias (who also designed the Mercat de Sant Antoni) and built between 1874 and 1878 by master builder Josep Fontserè i Mestre and engineer Josep Maria Cornet i Mas. The structure of cast iron columns and metallic horses was fabricated by La Maquinista Terrestre i Marítima.\n\nThe market came into operation in 1878 and was in use as the central market in town until 1971. At its closure, it was functioning as a wholesale market, but was replaced with the opening of Mercabarna in Zona Franca.\n\nIn recent years, the area immediately surrounding the market has been referred to as “el Born” or the castilian variant “el Borne”. A heavily gentrified area considered to be south of Carrer de la Princesa, it is full of restaurants, bar, and some small shops with many expatriates both living and socializing there. Despite this colloquial name given to the area (which is often applied to the entire district), it is still officially called la Ribera or Sant Pere, Santa Caterina i la Ribera.\n\nRestoration work started and stopped several times since the closure of market. Each successive city government had a different plan for the very large space. At some points, there were even plans to lease it to a retail establishment such as FNAC who had expressed interest.\n\nAfter closure, it fell into a state of disrepair and was restored 1977 to 1981 under the direction of Pere Espinosa.\n\nIn 2002 work was started to install the Biblioteca Provincial de Barcelona, but during excavations, extensive ruins of the medieval city were discovered. It was then decided to preserve the ruins and move the library project to another location.\n\nCurrently, the market covers these archaeological ruins which were part of the la Ribera district that was demolished in the early eighteenth century after the defeat of Catalonia in the War of Succession in 1714. This portion of la Ribera was forcibly demolished to make way for the construction of the Ciutadella military structure as ordered by the new Spanish king, Philip V.\n\nThe plan that finally came to fruition in 2013 was to expose the subterranean ruins for visitors while preserving space around the exterior of them for mixed use, cultural center, in addition to having a museum about the War of Succession onsite. At the same time, it is now possible for pedestrians to pass freely from Passeig del Born through to the other side that leads to the park of Ciutadella.\n\nThe official inauguration of the restored market was September 11, 2013 which was the 299th anniversary of the fall of Barcelona following its siege that marked the end of an independent Catalonia state and the start of nearly three centuries of suppression of Catalan autonomy by the Spanish Kingdom.",
     "street":"Carrer del Comerç, 2, 08003, Barcelona",
     "latitude":41.38580350488091,
     "longitude":2.1837674060820973,
     "foto-peq":"mercatBornSmall.jpeg",
     "foto-gran":"mercatBornBig.jpg",
     "color":"white",
     "squareX":20.0,
     "squareY":0.0,
     "offset":225.0
     },
     {"name":"Arc de Triomf",
     "description":"In 1888 Barcelona hosted the Universal Exhibition. The Arc de Triomf was built as the gateway to the fair which was held in the Parc de la Ciutadella. The monument is classical in shape and proportions and features ground-breaking sculptural and decorative finishes replete with symbolism. It has become one of the city’s iconic landmarks.\n\nThe Arc de Triomf rises up majestically at the top of the Passeig Lluís Companys. The gateway to the 1888 Universal Exhibition, the arch stood at the end of the Saló de Sant Joan, the boulevard that led to the exhibition grounds in the Parc de la Ciutadella. The architect Josep Vilaseca designed a monument of classical style and proportions as an allegory of Barcelona’s respect for the nations and provinces taking part in the exhibition. As a counterpoint, Vilaseca chose to build the arch from brick and decorate it with sculptural motifs evocative of the neo-Mudejar style that was very much in vogue in Spain at the time. The combination of red brick with the series of friezes around the arch, make it a singularly beautiful landmark.\n\nIf you take a close look at the arch you’ll soon realise that the Arc de Triomf was the gateway to the modern Barcelona of the late 19th century. The frieze overlooking the Passeig de Sant Joan depicts Barcelona welcoming the nations and the frieze facing the park shows the city presenting medals to the exhibition participants. There are reliefs on one side symbolising agriculture and industry, and commerce and art on the other. At the top of the arch the shields of the 49 Spanish provinces are presided over by the coat of arms of the city of Barcelona.",
     "street":"Passeig Lluís Companys, 08018, Barcelona",
     "latitude":41.39108459569846,
     "longitude":2.180623442327942,
     "foto-peq":"arcTriomfSmall.jpeg",
     "foto-gran":"arcTriomfBig.jpg",
     "color":"white",
     "squareX":20.0,
     "squareY":0.0,
     "offset":185.0
     },
     {"name":"Museu Picasso",
     "description":"The museum shows the solid bond between the Malaga-born genius and the city of Barcelona. The permanent collection comprises over 3,800 works from different periods, but with particular emphasis on works from his formative years and youth. The Museum Picasso also features the extraordinary Las Meninas series, works from the Blue Period, as well as an extensive programme of exhibitions which complement the permanent collections.\n\nThe museum is embarking on a new phase of expansion with the launch of new programmes and activities designed to make it a key centre for fostering knowledge and education, encouraging visitor participation and a critical approach. The museum seeks to provide a space for dialogue, offering new perspectives on Picasso and the collection as a whole.",
     "street":"Carrer Montcada, 15-23, 08003, Barcelona",
     "latitude":41.38520795035032,
     "longitude":2.180900746627003,
     "foto-peq":"museuPicassoSmall.jpeg",
     "foto-gran":"museuPicassoBig.jpg",
     "color":"white",
     "squareX":0.0,
     "squareY":0.0,
     "offset":225.0
     },
     {"name":"Torre Agbar",
     "description":"This new landmark on the Barcelona skyline was added in 2003: an enormous bullet-shaped cylinder emerging from the ground and pointing skywards, with a glass surface in which the colours of the Mediterranean are reflected. The Agbar Tower is one of the symbols of contemporary Barcelona.\n\nBarcelona’s new iconic landmark was the result of a collaboration between the Atelier Jean Nouvel and the Barcelona-based b720 architectural practice, and was inaugurated in the Plaça de les Glòries in 2003. Like a geyser bubbling up from the depths of the earth, the Torre Agbar, which is the headquarters of the water company Grup Agbar, has an eye-catching outline. It stands 144 metres tall and provides an imposing observation deck over the new Barcelona. The French architect Jean Nouvel took into account the building’s location when he designed it, and this is why its shape is reminiscent of the mountain of Montserrat or the Gaudiesque forms of the Sagrada Família. He also harnessed solar power and groundwater to reduce energy consumption.\n\nThe tower has an oval, almost circular base and the interior is spacious and open-plan without pillars. The outer curtain wall is clad in different-coloured glass louvers which can be tilted at different angles. The colour scheme changes from the warmer reddish tones at the base to cooler blues and whites at the top. At night, when the tower is lit up and saturated with colour, it is a beautiful sight.",
     "street":"Avinguda Diagonal, 211, 08018, Barcelona",
     "latitude":41.40357442172985,
     "longitude":2.189529830688457,
     "foto-peq":"torreAgbarSmall.jpeg",
     "foto-gran":"torreAgbarBig.jpg",
     "color":"white",
     "squareX":55.0,
     "squareY":0.0,
     "offset":185.0
     },
     {"name":"Monument a Colom",
     "description":"The Columbus Monument is a 60 m (197 ft) tall monument to Christopher Columbus at the lower end of La Rambla, Barcelona, Catalonia, Spain. It was constructed for the Exposición Universal de Barcelona (1888) in honor to Columbus first voyage to the Americas. The monument serves as a reminder that Christopher Columbus reported to Queen Isabella I and King Ferdinand V in Barcelona after his first trip to the new continent.\n\nAt the very top of the monument stands a 7.2 m (24 ft) tall bronze statue atop a 40 m (131 ft) tall Corinthian column. The statue was sculpted by Rafael Atché and is said to depict Columbus pointing towards the New World with his right hand, while holding a scroll in the left. It is a commonly held belief that instead of pointing to the west towards the New World, the statue points east towards Columbus's supposed home city of Genoa. This, however, is not true, as the statue points south-southeast (a more southerly direction than the adjacent Rambla Del Mar and almost a perfect extension of the direction of La Rambla, Barcelona) and in effect is pointing at a point somewhere near the city of Constantine, Algeria. To point at Genoa in northern Italy the statue would have to face east-northeast and point up the coastline. It is more likely that the statue is situated in the current way simply to have Columbus point out to sea underscoring his achievements in naval exploration. The statue is atop a socle, on which the word “Tierra” (land) is inscribed.\n\nThe idea of a monument to Columbus came in 1856 from Antoni Fages i Ferrer, who proposed that it be constructed entirely by Catalans, but he got nowhere with his plan for sixteen years. Finally in 1872 he gained the support of the mayor of the city, Francesc Rius i Taulet, and in 1881 the city passed a resolution to build the monument. A contest was held exclusively for Spanish artists to submit their designs with the winner being Gaietà Buigas i Monravà, a Catalan. Most of the money was privately raised, with only twelve percent being financed with public funds. All of the funding came from Spanish sources and the entire construction (labour and materials) was done by Catalans. Construction began in 1882 and was completed in 1888 in time for the Exposición Universal de Barcelona.",
     "street":"Plaçca Portal de la Pau, s/n, 08001, Barcelona",
     "latitude":41.375830275297126,
     "longitude":2.177786229530284,
     "foto-peq":"monuColonSmall.jpeg",
     "foto-gran":"monuColonBig.jpg",
     "color":"white",
     "squareX":15.0,
     "squareY":0.0,
     "offset":200.0
     },
     {"name":"La Dorada: El peix d'or",
     "description":"Since the beginning of his career, Frank Gehry has investigated about the freedoms of expression that allows formal analysis of the fish. In the 80 years that some objects designed to explore these possibilities.\n\nIn this case, during the Barcelona Olympics, he was charged in a speech to the port which has very large steel structure in the form of fish, whose golden mark the start of the Olympic harbor promenade.\n\nThis was the first project that experimented with the computer to help him build its complicated structure and curvilinear forms that have skewed so much fame.\n\nThis is a monumental metal sculpture. Pez Dorado is a network of thin metal lines intersecting to form a lattice with a style markedly abstract. Nevertheless, it sensed the figure of a fish whose scales acquired a gold when they affect the sun's rays.\n\nGehry describes his constructions “fish”. The skin of a fish or imply neither articulates how his internal organs. However, a fish can be beautiful, definitely tailored to fit their environment, and its skin is used to keep the body dynamically consistent. The idea of the fish, he says, is an expression of their anger against useless historical references of postmodernism.\n\nGehry uses computer-aided design not to create their models, which are made by hand, but to provide precise specifications for their construction asymmetrical forms.\n\nThis sculpture depicts a alrge metallic gold fish. It measures 35 x 54 meters, and is entirely made​of stainless steel.",
     "street":"Carrer Marina, 19-21, 08005, Barcelona",
     "latitude":41.38607815025773,
     "longitude":2.1969962104949445,
     "foto-peq":"laDoradaSmall.jpeg",
     "foto-gran":"laDoradaBig.jpg",
     "color":"white",
     "squareX":55.0,
     "squareY":0.0,
     "offset":175.0
     },
     {"name":"Barceloneta (Plaça del Mar)",
     "description":"La Barceloneta is a neighborhood in the Ciutat Vella district of Barcelona, Catalonia, Spain. The neighborhood was constructed during the 18th century for the residents of the Ribera neighborhood who had been displaced by the construction of the Ciudadela of Barcelona. The neighborhood is roughly triangular, bordered by the Mediterranean Sea, the Moll d'Espanya of Port Vell, and the El Born neighborhood. The neighborhood is serviced by its own stop on the Barcelona Metro. Torre Sant Sebastià is the terminus of the Port Vell Aerial Tramway; opened in 1931, it connects La Barceloneta with Montjuïc across Port Vell.\n\nLa Barceloneta is known for its sandy beach (which made an appearance in Don Quixote, book 2) and its many restaurants and nightclubs along the boardwalk. Over the past several years the quality of the sand on the beach has become a source of continued controversy. In February 2008, the World Health Organisation began an inquiry designed to ascertain whether the sand meets WHO beach health and safety guidelines.\n\n Amongst the attractions on Barceloneta's beach are German artist Rebecca Horn's “Homenatge a la Barceloneta” monument, and, where the beach gives way to the Port Olimpic, Frank Gehry's modern “Peix d'Or” sculpture.\n\nIn the center of the neighborhood, there is a small museum, called “Casa de la Barceloneta”, which is housed in a preserved building dating back to 1761.",
     "street":"Plaça del Mar, 1, 08002, Barcelona",
     "latitude":41.37432475622,
     "longitude":2.1892070755156965,
     "foto-peq":"barcelonetaSmall.jpeg",
     "foto-gran":"barcelonetaBig.jpg",
     "color":"white",
     "squareX":50.0,
     "squareY":0.0,
     "offset":190.0
     },
     {"name":"MNAC",
     "description":"The Museu Nacional d'Art de Catalunya abbreviated as MNAC, is the national museum of Catalan visual art located in Barcelona, Catalonia, Spain. Situated on Montjuïc hill at the end of Avinguda de la Reina Maria Cristina, near Pl Espanya, the museum is especially notable for its outstanding collection of romanesque church paintings, and for Catalan art and design from the late 19th and early 20th centuries, including modernisme and noucentisme. The Museum is housed in the Palau Nacional, a huge, Italian-style building dating to 1929. The Palau Nacional, which has housed the Museu d'Art de Catalunya since 1934, was declared a national museum in 1990 under the Museums Law passed by the Catalan Government. That same year, a thorough renovation process was launched to refurbish the site, based on plans drawn up by the architects Gae Aulenti and Enric Steegmann, who were later joined in the undertaking by Josep Benedito. The Oval Hall was reopened in 1992 on the occasion of the Olympic Games, and the various collections were installed and opened over the period from 1995 (when the Romanesque Art section was reopened) to 2004. The Museu Nacional d'Art de Catalunya (Museu Nacional) was officially inaugurated on 16 December 2004.\n\nThe history of this institution dates back to the 19th century, when, in accordance with the principles that inspired Catalonia's cultural and political Renaixença (renaissance), a movement particularly active in that century, many projects were launched to help revive and conserve the country's artistic heritage. This process began with the establishment of the Museu d'Antiguitats de Barcelona (Barcelona Museum of Antiquities) in the Chapel of St Agatha (1880) and the Museu Municipal de Belles Arts (Municipal Fine Art Museum) in the Palau de Belles Arts (1891), a palace built to mark the occasion of the 1888 Universal Exhibition. A project to install all these Catalan art collections in the Palau Nacional, launched in 1934 under the initiative of Joaquim Folch i Torres, the first director of Catalonia Museum of Art, was frustrated by the outbreak of the Spanish Civil War (1936–1939), when for protection many works were transferred to Olot, Darnius and Paris (where an important exhibit was established). During the postwar period, the 19th- and 20th-century collections were installed in the Museu d'Art Modern, housed from 1945 to 2004 in the Arsenal building in Barcelona’s Parc de la Ciutadella, whilst the Romanesque, Gothic and baroque collections were installed in the Palau in 1942.\n\nThe Palau Nacional, which has housed the Museu d'Art de Catalunya since 1934, was declared a national museum in 1990 under the Museums Law passed by the Catalan Government. In 1992 a thorough renovation process was launched to refurbish the site, based on plans drawn up by the architects Gae Aulenti and Enric Steegmann, who were later joined in the undertaking by Josep Benedito. The Oval Hall was reopened in 1992 on the occasion of the Olympic Games, and the various collections were installed and opened over the period from 1995 (when the Romanesque Art section was reopened) to 2004. The Museu Nacional d’Art de Catalunya (Museu Nacional) was officially inaugurated on 16 December 2004.\n\nSince 2004, the Palau Nacional has once more housed several magnificent art collections, mostly by Catalan art, but also Spanish and European art. The works from that first museum have now been enriched by new purchases and donations, tracing the country’s art history from early medieval times to the mid-20th century: from Romanesque, Gothic, Renaissance and baroque to modern art. This heritage is completed by the Gabinet Numismàtic de Catalunya (coin and medal collections), the Gabinet de Dibuixos i Gravats (drawings and engravings) and the Library.",
     "street":"Palau Nacional, Parc de Montjuïc, s/n, 08038, Barcelona",
     "latitude":41.36827886528767,
     "longitude":2.1537416613768983,
     "foto-peq":"mnacSmall.jpeg",
     "foto-gran":"mnacBig.jpg",
     "color":"black",
     "squareX":20.0,
     "squareY":0.0,
     "offset":220.0
     },
     {"name":"Plaça Espanya",
     "description":"Plaça d'Espanya, also known as Plaza de España in Spanish, is one of Barcelona's most important squares, built on the occasion of the 1929 International Exhibition, held at the foot of Montjuïc, in the Sants-Montjuïc district.\n\nOne of the city's biggest squares, it is the junction of several major thoroughfares: Gran Via de les Corts Catalanes, Avinguda del Paral·lel, Carrer de la Creu Coberta and Carrer de Tarragona, and leads to the Palau Nacional through Avinguda de la Reina Maria Cristina, which houses one of Catalonia's finest museums, the Museu Nacional d'Art de Catalunya (MNAC). It was designed by Josep Amargós. The fountain at the centre of the square was designed by Josep Maria Jujol, a collaborator of Antoni Gaudí, while Miquel Blay designed the statues. The buildings were designed by Nicolau Maria Rubió i Tudurí.\n\nThe square was built on a site that had been previously used for public hangings, until the creation of the now demolished Ciutadella fortress in 1715, where the gallows were moved. It was designed in 1915 and built in 1929 so that it could be ready to host the 1929 Universal Exposition. The square has been in public use since then.",
     "street":"Plaça Espanya, s/n, 08004, Barcelona",
     "latitude":41.37499114313721,
     "longitude":2.1491142232788434,
     "foto-peq":"plEspanyaSmall.jpeg",
     "foto-gran":"plEspanyaBig.jpg",
     "color":"white",
     "squareX":0.0,
     "squareY":0.0,
     "offset":175.0
     },
     {"name":"Palau Sant Jordi",
     "description":"Palau Sant Jordi is an indoor sporting arena and multi-purpose installation that is part of the Olympic Ring complex located in Barcelona, Catalonia, Spain.\n\nDesigned by the Japanese architect Arata Isozaki, it was opened in 1990. The maximum seating capacity of the arena is 17,000 for basketball, and 24,000 for musical events.\n\nThe Palau Sant Jordi was one of the main venues of the 1992 Summer Olympics hosting the artistic gymnastics, handball final, and volleyball final events. Today, it is used for all kinds of indoor sport events as well as for concerts and other cultural activities, due to its great flexibility.\n\nThe arena was the venue of the 1995 IAAF World Indoor Championships in Athletics.\n\nIt was the venue of three Euroleague final four in 1998, 2003 and 2011. It also hosted the EuroBasket 1997 from the quarter-finals and the 2012 Spanish Basketball Cup.\n\nThe final of 2000 Davis Cup was the 89th edition of the most important tournament between nations in men's tennis. Spain defeated Australia at Palau Sant Jordi on 8–10 December, giving Spain their first title. The arena also hosted the finals of 2009 Davis Cup between Spain and Czech Republic with the victory for the Spaniards 5-0.\n\nPalau Sant Jordi was the main venue of the 2003 FINA World Championships. A temporary, regulation swimming pool was installed for the occasion. It played the same role for the 2013 FINA World Championships, since the city of Barcelona hosted the Championships again after 10 years.\n\nIt was one of six sites that hosted the 2013 World Men's Handball Championship including the final. It was also one of the six sites that hosted the 2014 FIBA Basketball World Cup in Spain.",
     "street":"Passeig Olímpic, 5-7, 08038, Barcelona",
     "latitude":41.36342618837599,
     "longitude":2.1525628359374878,
     "foto-peq":"santJordiSmall.jpeg",
     "foto-gran":"santJordiBig.jpg",
     "color":"black",
     "squareX":15.0,
     "squareY":0.0,
     "offset":225.0
     },
     {"name":"Parc de la Ciutadella",
     "description":"The Parc de la Ciutadella is a park in Ciutat Vella, Barcelona, Catalonia. After its establishment during the mid-19th century, it was for decades the only green area in the city, and hitherto of the most popular. It is located at the northeastern edge of the old town, and hosts within its 70 acres (280,000 m2) the city's substantial zoo (which was home to the famous albino gorilla Snowflake), the Parliament of Catalonia, a lake, some museums, and a fountain of considerable size designed by Josep Fontserè (with perhaps some attributions of the young student Antoni Gaudí, who at this time worked at Fontserès office). It is characterized by being a very busy place, crowded with tourists, and locals, who are usually going for a walk or taking their children to the special section for kids found near the upper margin of the park. This park is optimal for sports, like for example boating in the lake, cycling (both boat and bicycle can be hired), or jogging.\n\nThe main attraction has, from its establishment hitherto been the zoo. This was due to out of the 7,000 animals present the albino gorilla Snowflake, who died in 2004. Near the zoo's entrance, the famous climbable gigantic stone mammoth is to be seen, as is a metallic cat in another area of the park.\n\nAnother yet to be mentioned conspicuous characteristic is the park's paths' layout, one half being made up by sinuous and rather natural seeming trails, and the other by direct and refined ones. Along both, huge a variety of vegetation is assertively displayed, having small signposts at their front, serving as name tags.\n\nIn 1714, after a 13-month war (War of the Spanish Succession), Barcelona fell to the army of Philip V of Spain. In order to maintain control over the city, and to prevent the Catalans from rebelling as they had in the previous century, King Philips V built the citadel of Barcelona, at that time the largest fortress in Europe.\n\nA substantial part of the district it was constructed in (La Ribera) was destroyed to obtain the necessary space, leaving its inhabitants homeless. The fortress was characterized by having five corners, which gave the citadel defensive power, and by a rather wide surrounding margin, serving as location for the army's cannons. It included enough buildings to house 8,000 people.\n\nHundreds of Catalonians were forced to work on the construction for three years, while the rest of the city provided financial backing for this and for warfare-related expenses as well, with a new tax named el cadestre. Three decades later a quarter was rebuilt around the fortress named Barceloneta, which is located inside the neighborhood Ciutat Vella.\n\nIn 1841 the city's authorities decided to destroy the fortress, which was hated by Barcelona's citizens. Yet two years later, in 1843, under the regime of Maria Cristina, the citadel was restored. In 1848, after Maria Cristina's abdication and as the citadel lost its use, General Espartero razed most of the buildings within the fortress as well as its walls by bombarding it from the nearby mountain fortress Montjuic, which helped him gain political popularity. By 1869, as the political climate liberalised enough to permit it, General Prim decided to turn over what was left of the fortress to the city and some buildings were demolished under Catalan orders, for it was viewed as by the citizens as a much-hated symbol of central Spanish government.\n\nThe chapel (now the Military Parish Church of Barcelona), the Governor's palace (now Verdaguer Secondary School), and the arsenal (which is now home to the Catalan Parliament) remain, with the rest of the site being turned into the park of the citadel as we now know it, on the grounds of the former fortress, as work by the architect Josep Fontsére in 1872. Nineteen years later, in 1888, Barcelona held the Exposición Universal de Barcelona extravaganza, inspired by Mayor Rius i Taulet, and the park was redesigned with the addition of sculptures and other complementary works of art. This marked the conclusion of the old provincial and unprogressive Barcelona and the establishment of a modern cosmopolitan city. From that point until 1892, half of the park's layout was yet again enhanced, in order to obtain sufficient space for the zoo.\n\nThe Cascada (waterfall or cascade in Spanish) is located at the northern corner of the park opposite to the lake. It was first inaugurated in 1881 without sculptures or any meticulous details, and was thereby criticized by the press, after which this triumphal arch was thoroughly amended by the addition of a fountain and some minor attributes, which required six years of construction from 1882 to 1888, and was thenceforth put on display at the Universal Exhibition, and hitherto not been redesigned. It was erected by Josep Fontsére and to a small extent by Antoni Gaudí, who at that time was still an unknown student of architecture. Fontsére aimed to loosely make it bear resemblance to the Trevi Fountain of Rome.\nTwo enormous pincers of gigantic crabs serve as stairs to access a small podium located in the centre of the monument. In front of it a sculpture (designed by Venanci Vallmitjana) of Venus standing on an open clam was placed. The whole cascade is divided in two levels. From the podium on a path leads to the Feminine Sculpture and to the northeastern corner of the park, and upon following the route down the stairs the fountain's pond is rounded and the southern tip of the artifact is reached.\n\nThe lake characterizes the park as a scenery enjoyable for romantics. The lake's location, surroundings, and visitors turns this big sector into a rather convivial place, in which little turtles can be found on rocks, and fishes dashing through the water. Just next to it lies the thickest and most beauteous vegetation that can be spotted in the green areas of Barcelona. There is a locally somewhat famous tree which grows inside the water and separates from the other due to its attractive form and its propagation of bananas.\n\nThe zoo of Barcelona is located in the park of the ciutadella due to the availability of a few buildings which were left empty after the Universal Exposition of 1888. It was inaugurated in 1892, during the day of the Mercé, the patron saint of the city. The first animals were donated by Lluís Martí i Codolar to the municipality of Barcelona, which gratefully approved of their accommodation in the zoo.\nNowadays, with one of the most substantial collections of animals in Europe, the zoo affirms that their aim is to conserve, investigate, and educate.\nFrom 1966 to 2003 the zoo was home to the famous albino gorilla Snowflake, who attracted many international tourists and locals.\nApart from the usual visits, different types of guided tours or other activities are offered, like for example 20 types of diversionary workshops, excursions and fieldtrips for schoolchildren, or personnel training and educational courses in zoology for adults. More than 50,000 children visit the zoo on an annual basis, which is the reason for the zoo's emphasis on education.\n\nThe zoology museum of Barcelona, together with the museum of geology, make up the Museum of Natural Science. It was constructed briefly previous to the Exposición Universal de Barcelona (1888) by the architect Lluís Doménech i Montaner, and served as exhibition to the aforementioned extravaganza. Most of the building is constructed, as to be seen on the right picture, with red bricks. The most popular displays are the gigantic skeleton of the whale, and the exhibits dedicated for smaller children. The institute's authorities aver that their vital aims are to enhance knowledge and conservation of the natural diversity of Catalonia and its surroundings, and to promote the public the learning and discovery of the natural world, just as to transmit ethical values of respect for nature and to stimulate informed debate on the burning issues and environmental problems that concern society.\n\nThe museum of geology is a legacy of the scientist Francisco Martorell i Peña (1822–1878). He donated his whole collection of artifacts of cultural and archeological importance, his scientific library, and an amount of 125.00 pesetas to the city, and demanded correct usage of these by means of the founding of a new museum to save his bequest. That same year a new building was constructed for the requested purpose, and named by the Corporación Municipal after its donor. The responsible architect was Antoni Rivas i Trias, who decided to build the museum in the park of the citadel.",
     "street":"Passeig de Picasso, 21, 08003, Barcelona",
     "latitude":41.3880344577576,
     "longitude":2.1861224883605246,
     "foto-peq":"ciutadellaSmall.jpeg",
     "foto-gran":"ciutadellaBig.jpg",
     "color":"white",
     "squareX":10.0,
     "squareY":0.0,
     "offset":125.0
     },
     {"name":"Plaça de Catalunya",
     "description":"Plaça de Catalunya, sometimes referred to as Plaza de Cataluña (its Spanish name) is a large square in central Barcelona that is generally considered to be both its city centre and the place where the old city (see Barri Gòtic and Raval, in Ciutat Vella) and the 19th century-built Eixample meet.\n\nSome of the city's most important streets and avenues meet at Plaça Catalunya: Passeig de Gràcia, Rambla de Catalunya, La Rambla or Portal de l'Àngel, in addition to Ronda de Sant Pere, Carrer de Vergara or Carrer de Pelai. The plaza occupies an area of about 50,000 square metres. It is especially known for its fountains and statues, its proximity to some of Barcelona's most popular attractions, and for the flocks of pigeons that gather in the centre.\n\nAfter the medieval city walls were demolished in the 19th century, ambitious designs for the city's public spaces were conceived under the guidance of notable urban planners. Plaça Catalunya was conceived as part of pla Rovira in 1859, but no official permission from the government was given until the 1888 Universal Exposition. It was urbanised for the first time in 1902 and was further modified in 1929, on the occasion of the 1929 Barcelona International Exposition, which also included the construction of a metro station. Architect Francisco Nebot designed the changes made in 1929.\n\nIn May 2011 Plaça Catalunya was the main location where anti-government protests and sit ins were held in Barcelona, mirroring the events in other Spanish cities.",
     "street":"Plaça de Catalunya, s/n, 08002, Barcelona",
     "latitude":41.386984218347955,
     "longitude":2.170050575671439,
     "foto-peq":"plCatSmall.jpeg",
     "foto-gran":"plCatBig.jpg",
     "color":"white",
     "squareX":10.0,
     "squareY":0.0,
     "offset":200.0
     },
     {"name":"Plaça Sant Jaume",
     "description":"The Plaça de Sant Jaume is a square at the center of the Old City of Barcelona, and the administrative heart of both the city and surrounding Catalonia. This is because the Palace of the Generalitat of Catalonia and the City Hall are located here across from one another.\n\nThe Plaça Sant Jaume is located at the former center of the Roman city of Barcino, where its main streets, the Cardo (modern day Llibreteria and Call streets) and Decumanus (now the streets of Bisbe/Ciutat/Regomir), crossed. At this junction there was the forum and the Temple of Augustus, of which four columns are preserved on top of Mont Tàber, found at the adjacent Paradís Street.\n\nThe Square takes its modern name from the church of Church of Sant Jaume, which had been located at the site of the square since medieval times. Formerly, the city council of Barcelona met in the porch at the front of that church, until it bought a number of nearby homes that would house the future headquarters of the institution on the neighboring street. The old church was demolished in 1823 when Ferran Street was being built; its demolition also allowed for the Square to be rebuilt as it exists today. Note that prior to these demolitions, the square was limited to a small angular space, with the rest of the future plaza being occupied by the same church, its cemetery, and the houses of the Magistracy and the General Court of the Veguer.\n\nThe Plaça Sant Jaume has also been called “Constitution Square” in various historical periods, and this name still appears on a plaque on the façade of the City Hall.",
     "street":"Plaça de Sant Jaume, s/n, 08002, Barcelona",
     "latitude":41.38268720095491,
     "longitude":2.176995614680436,
     "foto-peq":"santJaumeSmall.jpeg",
     "foto-gran":"santJaumeBig.jpg",
     "color":"white",
     "squareX":0.0,
     "squareY":0.0,
     "offset":175.0
     },
     {"name":"Plaça del Rei",
     "description":"Plaça del Rei is a 14th-century medieval public square in the Barri Gòtic of Barcelona.\n\nThe square is surrounded by the Palau Reial Major including the Saló del Tinell, the Palau del Lloctinent (“Lieutenant's Palace”), the 15th-century tower Mirador del Rei Martí (“King Martin's Watchtower”), and the Capella Reial de Santa Àgata (“Royal Chapel of St Agatha”). On its southern side stands Casa Padellàs (Padellàs's House) a 15th-16th century palazzo which was moved to here stone by stone from Mercaders street in 1931 and that since 1943 houses the Barcelona City History Museum (MUHBA).\n\nTopos V, a work by Eduardo Chillida underlines one of the corners of the square.",
     "street":"Plaça del Rei, s/n, 08002, Barcelona",
     "latitude":41.3841279,
     "longitude":2.1773638,
     "foto-peq":"plReiSmall.jpeg",
     "foto-gran":"plReiBig.jpg",
     "color":"white",
     "squareX":0.0,
     "squareY":0.0,
     "offset":102.5
     },
     {"name":"Plaça Reial",
     "description":"Plaça Reial (In Spanish Plaza Real, meaning “Royal Plaza”) is a square in the Barri Gòtic of Barcelona, Catalonia, Spain. It lies next to La Rambla and constitutes a well-known touristic attraction, especially at night. On the plaza are a large number of restaurants and some of the city's most famous nightclubs including Sidecar, Jamboree or Karma. It is also known for its many outdoor venues and is a popular meeting place during the summer and the annual La Mercè festival in September, when open air concerts take place, and during other celebrations such as New Year's Eve, often being very crowded.\n\nThe Plaça Reial was designed by Francesc Daniel Molina i Casamajó in the 19th century. The square is twinned with Plaza Garibaldi, in Mexico City. The lanterns there were designed by the Catalan architect Antoni Gaudí. The square is the site of the Hotel Roma Reial and club.",
     "street":"Plaça Reial, s/n, 08002, Barcelona",
     "latitude":41.380090928622934,
     "longitude":2.1752732343933303,
     "foto-peq":"plReialSmall.jpeg",
     "foto-gran":"plReialBig.jpg",
     "color":"white",
     "squareX":50.0,
     "squareY":0.0,
     "offset":165.0
     },
     {"name":"Catedral de Barcelona",
     "description":"The Cathedral of the Holy Cross and Saint Eulalia, also known as Barcelona Cathedral, is the Gothic cathedral and seat of the Archbishop of Barcelona, Spain. The cathedral was constructed from the 13th to 15th centuries, with the principal work done in the 14th century. The cloister, which encloses the Well of the Geese (Font de les Oques) was completed in 1448. In the late 19th century, the neo-Gothic façade was constructed over the nondescript exterior that was common to Catalan churches. The roof is notable for its gargoyles, featuring a wide range of animals, both domestic and mythical.\n\nIt is a hall church, vaulted over five aisles, the outer two divided into chapels. The transept is truncated. The east end is a chevet of nine radiating chapels connected by an ambulatory. The high altar is raised, allowing a clear view into the crypt.\n\nThe cathedral is dedicated to Eulalia of Barcelona, co-patron saint of Barcelona, a young virgin who, according to Catholic tradition, suffered martyrdom during Roman times in the city. One story says that she was exposed naked in the public square and a miraculous snowfall in mid-spring covered her nudity. The enraged Romans put her into a barrel with knives stuck into it and rolled it down a street (according to tradition, the one now called Baixada de Santa Eulàlia). The body of Saint Eulalia is entombed in the cathedral's crypt.\n\nThe choir stalls retain the coats-of-arms of the knights of the Order of the Golden Fleece. In his first trip into Spain, Charles, the future Holy Roman Emperor, selected Barcelona as the site of a chapter of his Order. The king had arrived for his investiture as Count of Barcelona, and the city, as a Mediterranean port, offered the closest communication with other far-flung Habsburg dominions, while the large proportions of the cathedral would accommodate required grand ceremonies. In 1518 the Order's herald, Thomas Isaac, and its treasurer, Jean Micault, were commissioned to prepare the sanctuary for the first sitting of the chapter in 1519. Juan de Borgonya executed the painted decoration of the sanctuary.\n\nOne side chapel is dedicated to “Christ of Lepanto”, and contains a cross from a ship that fought at the Battle of Lepanto (1571). Catalan legend states that during the battle, the corpus suddenly and miraculously shifted to the right to avoid being hit by a cannonball, a miraculous sign from God that the Ottomans would be defeated. The chapel of Christ of Lepanto also contains the shrine and sepulchre of Saint Olegarius, who was a Bishop of Barcelona and an Archbishop of Tarragona.\n\nIn addition to Saints Eulàlia and Olegarius, the cathedral contains the tombs of Saint Raymond of Penyafort, Count Ramon Berenguer I and his third wife Almodis de la Marche, and bishops Berenguer de Palou II, Salvador Casañas y Pagés, and Arnau de Gurb, who is buried in the Chapel of Santa Llúcia, which he had constructed.\n\nThe cathedral has a secluded Gothic cloister where 13 white geese are kept, the number explained by the assertion that Eulalia was 13 when she was martyred.\n\nA program of cleaning and restoration of the cathedral was carried out from 1968-72.\n\nParts of an early Christian and visigothic episcopal complex including the baptistery (4th century), a basilical hall (5th century), a cross shaped church (6th-7th century) and bishop's palace (6th-7th century) are displayed in the Barcelona City History Museum archaeological underground. Reportedly, this Visigothic chapel was dedicated to Saint James, and was the proprietary church of the Viscounts of Barcelona. However, in a document from the Second Council of Barcelona in 599, it states that the cathedral was dedicated to the Holy Cross. This church was severely damaged by al-Mansur (Almanzor) during his attack on Barcelona in 985.\n\nIn 1046, Count Ramon Berenguer I and his wife Almodis, together with Bishop Guislabert, began construction of a Romanesque cathedral at the site; it was consecrated in November 1058. The cathedral was constructed over the crypt of the former church. It has been reported that a Viscount of Barcelona, Mir Geribert, sold the site to Bishop Guislebert in 1058, however this date does not coincide with the reported start of construction.\n\nThe present Gothic cathedral was begun on the foundations of the previous churches on 1 May 1298; James II the Just was King of Aragon at the time, and Bernat Pelegri was Bishop of Barcelona. The church was built from the east end towards the west end, with a simple west facade completed in 1417. The cloister was completed in 1448, making the total duration of construction 150 years. In the late 19th century, Miguel Girona i Agrafel offered to complete the neo-Gothic facade and towers as inspired by the original 15th-century design and drawn by the architect Josep O. Mestres. This work was completed in 1913 by Girona's children.",
     "street":"Pla de la Seu, s/n, 08002, Barcelona",
     "latitude":41.38403444819933,
     "longitude":2.1763278460326774,
     "foto-peq":"catedralSmall.jpeg",
     "foto-gran":"catedralBig.jpg",
     "color":"white",
     "squareX":0.0,
     "squareY":0.0,
     "offset":150.0
     },
     {"name":"Santa Maria del Mar",
     "description":"Santa Maria del Mar is an imposing church in the Ribera district of Barcelona, Spain, built between 1329 and 1383 at the height of Catalonia's maritime and mercantile preeminence. It is an outstanding example of Catalan Gothic, with a purity and unity of style that is very unusual in large medieval buildings.\n\nThe first mention of a church of Santa Maria by the sea dates from 998. The construction of the present building was promoted by the canon Bernat Llull, who was appointed Archdean of Santa Maria in 1324. Construction work started on 25 March 1329, when the foundation stone was laid by king Alfonso IV of Aragon (III of Catalonia), as commemorated by a tablet in Latin and Catalan on the façade that faces the Fossar de les Moreres. The architects in charge were Berenguer de Montagut (designer of the building) and Ramon Despuig, and during the construction all the guilds of the Ribera quarter were involved. The walls, the side chapels and the façades were finished by 1350. In 1379 there was a fire that damaged important parts of the works. Finally, on 3 November 1383 the last stone was laid and on 15 August 1384 the church was consecrated. In 1428 an earthquake caused several casualties and destroyed the rose window in the west end. The new window, in the Flamboyant style, was finished by 1459 and one year later the glass was added. The images and the Baroque altar were destroyed in a fire in 1936. The chapel of the Blessed Sacrament, adjacent to the apse, was added in the 19th century.\n\nFrom the outside, Santa Maria gives an impression of massive severity that belies the interior. It is hemmed in by the narrow streets of the Ribera, making it difficult to obtain an overall impression, except from the Fossar de les Moreres and the Plaça de Santa Maria, both of them former burial grounds. The latter is dominated by the west end of the church with its rose window. Images of Saint Peter and Saint Paul occupy niches on either side of the west door, and the tympanum shows the Saviour flanked by Our Lady and Saint John.\n\nThe north-west tower was completed in 1496, but its companion was not finished until 1902.\n\nn contrast with the exterior, the interior gives an impression of light and spaciousness. It is of the basilica type, with its three aisles forming a single space with no transepts and no architectural boundary between nave and presbytery. The simple ribbed vault is supported on slender octagonal columns, and abundant daylight streams in through the tall clerestorey windows.\n\nThe interior is almost devoid of imagery of the sort to be found in Barcelona's other large Gothic churches, the cathedral and Santa Maria del Pi, after the fire which occurred in 1936 during anticlerical disturbances. Amongst the most notable of the works destroyed at that time was the Baroque retable by Deodat Casanoves and Salvador Gurri.\n\nSome interesting stained-glass windows have survived from various periods.\n\nThe west end with its rose window, showing the proportions of the three aisles.\nThe spacing of the columns is the widest of any Gothic church in Europe—about forty-three feet apart, center to center.\n\nThe church has a serious claim to have the slenderest stone built columns in the world.",
     "street":"Plaça de Santa Maria, 1, 08003, Barcelona",
     "latitude":41.383866975462674,
     "longitude":2.1820818288360897,
     "foto-peq":"santaMariaSmall.jpeg",
     "foto-gran":"santaMariaBig.jpg",
     "color":"white",
     "squareX":20.0,
     "squareY":0.0,
     "offset":150.0
     },
     {"name":"Fossar de les Moreres",
     "description":"The Fossar de les Moreres is a memorial plaza in Barcelona (Catalonia, Spain), adjacent to the basilica of Santa Maria del Mar. The plaza was built over a cemetery where defenders of the city were buried following the Siege of Barcelona at the end of the War of the Spanish Succession in 1714. The plaza retains its everyday use as a public space, but also prominently features a memorial to the fallen Catalans of the war, with a torch of eternal flame and a heroic poem by Frederic Soler, “El Fossar de les Moreres”.\n\nIn the aftermath of the War of Spanish Succession, Catalonia suffered a loss of autonomy. The subsequent royal decrees known as the Decretos de Nueva Planta abolished the furs (fueros) of Catalonia as well as institutions that dated back to the time of the Crown of Aragon and beyond. At a later date the public use of the Catalan language was banned for public documents. These actions by Philip V have two interpretations. First there was an obvious desire to punish for the support that was offered to Archduke Charles. Territories in Spain that supported Philip V had a less severe restriction of their historical fueros. Second, Philip V was initiating in Spain a greater concentration and centralization of power that was occurring simultaneously in the other major European monarchies, namely Great Britain, France, and Austria. The Decretos dealt not only with Catalonia, but also with other parts of Spain and the empire as a whole. Philip V sought to regulate what had been a complex and sometimes conflicting polysynodal system of governance that characterized the first two centuries of the unified Spanish monarchy.\n\nGiven this tumultuous history connected with the decrees and the war, the Fossar de les Moreres is an important place of remembrance every year during the National Day of Catalonia (Diada Nacional de Catalunya in Catalan). The holiday commemorates the date on which Barcelona fell, 11 September, and some Catalans yearly pay homage to the defenders of city who were killed and are buried at the memorial.\n\nThe original cemetery in which Barcelona's defenders were buried was paved over, and the plaza was created during the urbanization of parochial cemeteries in 1821 under pressure from King Charles III of Spain and General Castaños.",
     "street":"Plaça Fossar de les Moreres, 08003, Barcelona",
     "latitude":41.38373817827634,
     "longitude":2.1823554141556087,
     "foto-peq":"fossarMoreresSmall.jpeg",
     "foto-gran":"fossarMoreresBig.jpg",
     "color":"white",
     "squareX":17.0,
     "squareY":0.0,
     "offset":225.0
     },
     {"name":"Casa Vicens",
     "description":"Casa Vicens is a family residence in Barcelona (Catalonia, Spain), designed by Antoni Gaudí and built for industrialist Manuel Vicens. It was Gaudí's first important work. It was added to the UNESCO World Heritage Site “Works of Antoni Gaudí” in 2005.\n\nIt was built in the period 1883-1889 and is located at Carrer de les Carolines 24, in the Gràcia district of Barcelona. The site was small (smaller today after the widening of the street) compared to similar homes in the area. Nevertheless, the house is sizeable, measuring some 1,160 m² on four levels.\n\nThis early work exhibits several influences, most notably the Moorish (or Mudéjar) influence, particularly evident at the top. The house is constructed of undressed stone, rough red bricks, and colored ceramic tiles in checkerboard and floral patterns. The owner, Manuel Vicens, was the owner of a brick and tile factory, so the ceramic tiles pay tribute to his business. The yellow, zinnia-flowered tile, designed by Gaudí, was manufactured by Vicens.\n\nThe plan is asymmetrical with protruding gables and buttresses. Galleries project even farther at the top. Rooftop towers are reminiscent of Moorish architecture.\n\nBecause the house is a private residence, its interior cannot be visited. Nevertheless, the house is generally open to “neighbours and citizens” on Saint Rita's Day, May 22.\n\nIn October, 2007, Altadicion, a real estate agency north of Barcelona, announced that they had been given an exclusive contract to sell the Casa Vicens. The asking price was 27 million euros.\n\nOn 27 March 2014 MoraBanc bought the Casa Vicens in order to open it to the public in 2016.",
     "street":"Carrer de les Carolines, 18-24, 08012, Barcelona",
     "latitude":41.40348170522695,
     "longitude":2.1506562288360556,
     "foto-peq":"casaVicensSmall.jpeg",
     "foto-gran":"casaVicensBig.jpg",
     "color":"white",
     "squareX":10.0,
     "squareY":0.0,
     "offset":190.0
     },
     {"name":"Finca Güell",
     "description":"The so-called Pavellons Güell, or Güell Pavilions, is a complex of buildings in the neighborhood of Pedralbes, Barcelona, by the Catalan Modernist architect Antoni Gaudí, built between 1884 and 1887.\n\nGaudí received the commission from his great patron, count Eusebi Güell.\n\nGüell had an estate in the Les Corts district of the small town of Sarrià (now part of Barcelona), which included two pieces of land known as Can Feliu and Can Cuyàs de la Riera. The architect Joan Martorell i Montells, one of Gaudí’s teachers, had built a Caribbean-style mansion, which stood almost where the Palau Reial de Pedralbes now stands. This house was called Torre Satalia, so christened by Jacinto Verdaguer, a friend of the family. Gaudí was commissioned to remodel the house and build a perimeter wall with gates.\n\nGaudí proposed an Orientalist design, somewhat reminiscent of Mudejar art. He planned an ashlar wall with several gates, of which the main gate would be a wrought-iron grille in the shape of a dragon, with glass eyes; it represented Ladon, offspring of Typhus, the dragon that guarded the Garden of the Hesperides, which was overcome by Hercules as one of his twelve labours—an episode that was narrated by Jacint Verdaguer in his poem L'Atlàntida, dedicated to Antonio López y López, first marquis of Comillas, who was Eusebi Güell’s brother in law. Over the dragon there is an antimony orange-tree, another allusion to the Hesperides. The shape of the dragon corresponds with the position of the stars in the Serpens constellation, because Ladon was turned into a snake as a punishment for stealing the oranges.\n\nThe other three entrances to the estate became obsolete with the construction of Avinguda Diagonal: one of them still stands outside the cemetery of Les Corts, although its iron grille has been moved to the Gaudí Museum in the Parc Güell; another was restored in 1982 by the University of Barcelona and installed at the Institut de Geologia Francesc Almera; while the third was demolished to make way for the Pharmacy faculty, but rebuilt in 1957 adjacent to this building.\n\nThe Pavilions consist of a stable, longeing ring and gatehouses.The stable is rectangular and roofed with a high Catalan vault adopting a catenary curve; the longeing ring has a square ground-plan,but is surmounted by a hyperboloid dome topped by an ornamental lantern; the gatehouses consist of three small buildings, the central one being polygonal in plan and the others cuboidal. All three are surmounted by ventilators in the form of chimneys, faced with ceramics. All the buildings are built of brick in a range of shades from red to yellow, and covered in coloured glass; in certain sections prefabricated cement blocks are also used.\n\nGaudí was also partially responsible for the design of the estate’s gardens, where he built two fountains and a pergola, and planted several Mediterranean species: (pines, eucalyptus, palms, cypresses and magnolias). The “Fountain of Hercules” still stands near the Palau Reial de Pedralbes, restored in 1983; it consists of a bust of Hercules surmounting a basin with the coat of arms of Catalonia and with a spout in the shape of a Chinese dragon.\n\nIn 1969 the Pavellons Güell were declared a Monument of National Historic and Artistic Interest. They are now used as the headquarters of the Royal Gaudí Chair, which pertains to the Universitat Politècnica de Catalunya, and the site also includes the Botanic Garden of Faculty of Biology.",
     "street":"Avinguda de Pedralbes, 7, 08034, Barcelona",
     "latitude":41.389285701711316,
     "longitude":2.119412064418043,
     "foto-peq":"fincaGuellSmall.jpeg",
     "foto-gran":"fincaGuellBig.jpg",
     "color":"white",
     "squareX":0.0,
     "squareY":0.0,
     "offset":160.0
     },
     {"name":"Estadi Olímpic",
     "description":"Estadi Olímpic Lluís Companys is a stadium in Barcelona, Catalonia, Spain. Originally built in 1927 for the 1929 International Exposition in the city (and Barcelona's bid for the 1936 Summer Olympics, which were awarded to Berlin), it was renovated in 1989 to be the main stadium for the 1992 Summer Olympics. The stadium has a capacity of 55,926 (67,007 during the 1992 Olympics), and is located in the Anella Olímpica, in Montjuïc, a large hill to the southwest of the city which overlooks the harbour.\n\nIn 2001 the stadium was renamed after the former president of the Generalitat de Catalunya Lluís Companys i Jover, who was executed at the nearby Montjuïc Castle in 1940 by the Franco regime.\n\nDesigned by architect Pere Domènech i Roura for the 1929 Expo, the stadium was officially opened on 4 July 1929 when Bolton Wanderers were invited to play a friendly against a Catalan XI.\n\nIt was meant to host the People's Olympiad in 1936, a protest event against the 1936 Summer Olympics in Berlin, but the event had to be cancelled due the outbreak of the Spanish Civil War.\n\nIn the fifties, the stadium was the centerpiece of the 1955 Mediterranean Games, and in 1957 it hosted the only national football cup final between FC Barcelona and RCD Espanyol, the two local clubs.\n\nIn the seventies the stadium was disused, and the stands deteriorated. When the Spanish Grand Prix and other races were held at the Montjuïc racing circuit, the stadium was used as a paddock for the teams. Due to safety concerns, the 1975 F1 race was nearly boycotted by drivers.\n\nDue to the award of the 1992 Summer Olympics to Barcelona, the stadium was renovated with the involvement of Italian architect Vittorio Gregotti. The stadium was gutted, preserving only the original facades, and new grandstands were built. In 1989 the venue was reinaugurated for the World Cup in Athletics, and three years later it hosted the opening and closing ceremonies and the athletics competitions of the Olympic Games.\n\nThe stadium served as the home of football club RCD Espanyol from 1997 until 2009. The Estadi Olímpic made its final La Liga appearance during the 2008-2009 season, as Espanyol moved to the newly constructed Estadi Cornellà-El Prat.\n\nIt also served as the home of the Barcelona Dragons American Football team until 2002. Because the size of the playing surface was slightly shorter than the regulation American Football length, the stadium only had 7-yard end zones, three yards shorter than regulation NFL size in 1991 and 1992. They were later lengthen to the standard 10 yards.\n\nThe stadium also played host to the NFL's American Bowl in 1993 and in 1994. The San Francisco 49ers played the Pittsburgh Steelers on 1 August 1993. The second game was played on 31 July 1994 between the Los Angeles Raiders and the Denver Broncos.\n\nThe stadium has since 1990 hosted the Míting Internacional d´Atletisme Ciutat de Barcelona an annual track and field meeting.\n\nIn 2010, the stadium hosted the 20th European Athletics Championships.",
     "street":"Passeig Olímpico, 17-19, 08038, Barcelona",
     "latitude":41.36471710999213,
     "longitude":2.155655540197813,
     "foto-peq":"estadiOlimpSmall.jpeg",
     "foto-gran":"estadiOlimpBig.jpg",
     "color":"white",
     "squareX":0.0,
     "squareY":0.0,
     "offset":200.0
     },
     {"name":"Casa Lleó i Morera",
     "description":"The Casa Lleó Morera is a building designed by noted modernisme architect Lluís Domènech i Montaner, located at Passeig de Gràcia 35 in the Eixample district of Barcelona. In 1902 Francesca Morera assigned Lluís Domènech i Montaner to remodel ancient “casa Rocamora”, built in 1864. She died in 1904, and the building was named after her son, Albert Lleó i Morera. The building is located on the corner of Carrer del Consell de Cent, and is one of the three important buildings of Barcelona's Illa de la Discòrdia (“Block of Discord”), and it is the only one building of the block awarded Barcelona's town council's Arts Building Annual Award (Concurso anual de edificios artísticos), obtained in 1906. Unfortunately, the building lost some of its most representative elements, such as the tempietto on its top (now restored) and the ground floor and mezzanine's architectural sculpture. The building is also known as the residence of Cuban-Catalan photographer Pau Audouard.\n\nThe building was not only the result of an architectural project, but —common practice in Catalan modernism architecture—, several artists collaborated with Domènech i Montaner so as to make a complete artwork, inspired in natural and organic motifs: Lluís Bru and Mario Maragliano were responsible of the mosaic work, Eusebi Arnau made the sculptures, Antoni Serra i Fiter elaborated the ceramics, and Gaspar Homar designed the decoration and the furniture.\n\nIt has been considered that Morera's family wanted to leave trace of their lineage with the continuous references to their family name (Morera, which means mulberry tree in English) in the decoration. Some examples are the mulberry tree found in the patio, the mulberry motifs of the door handles or the portraits made by Antoni Serra in the second floor.\n\nThe façade and ground floor of the building were decorated with big and varied modernist ornaments, with some outstanding sculptures by Eusebi Arnau surrounding the entrance, which represented two couples of feminine figures holding vases. Those sculptures were installed on double pairs of columns made of pink marble, and under the gallery of the first floor, other feminine heads could be found. On the first floor, aside the windows, two couples of feminine figures can also be found, showing several objects related to the technological improvements made in that period, such as the phonograph, electricity, telephone and photography. Barcelona's official chronicler Lluís Permanyer stated that this building is like “a scaled Palau de la Música Catalana”.\n\nThe building has been considered one of the best examples of modernisme architecture, but Noucentisme supporters performed several modifications to the original structure. In 1943, Raimon Duran i Reynals signed a refurbishing project for the ground floor, designed by Francisco Ferrer Bartolomé according to an assignment by Loewe so as to open a store. This project included the disappearance of the modernist windows and the ground floor feminine modernist plant boxes made by Eusebi Arnau, which were destroyed on the sidewalk using picks. The building caretaker later recovered the feminine heads, which were sold to Salvador Dalí, who installed them in Figuere's Teatre-Museu Dalí's patio.\n\nIn the mid-'80s of the 20th century, architect Òscar Tusquets was commissioned to restore the building. The pinnacles and the tempietto at the top of the structure, severely damaged by machine guns during the Spanish civil war were restored, and the ground floor damage was partially recovered. The building underwent another restoration process in 1992, and was bought by Grupo Núñez y Navarro in 2006, responsible of another restoration operation. Since 2007 the building is part of the Art Nouveau European Route.\n\nIn April 2012 finished the most recent restoration project, focused on the ground floor. Several elements such as the carriage entrance, several columns and mosaics were recovered.",
     "street":"Passeig de Gràcia, 35, 08007, Barcelona",
     "latitude":41.391179199999996,
     "longitude":2.165482613491804,
     "foto-peq":"casaLleoMoreraSmall.jpeg",
     "foto-gran":"casaLleoMoreraBig.jpg",
     "color":"white",
     "squareX":10.0,
     "squareY":0.0,
     "offset":150.0
     },
     {"name":"Gran Teatre del Liceu",
     "description":"The Gran Teatre del Liceu, or simply Liceu in Catalan and Liceo in Spanish, is an opera house on La Rambla in Barcelona, Catalonia, Spain. The Liceu opened on 4 April 1847.\n\nThe adjacent Liceu metro station is named after the theatre.\n\nIn contrast with other European cities, where the monarchy took on the responsibility of the building and upkeep of opera houses, the Liceu was funded by private shareholders of what would become the Societat del Gran Teatre del Liceu (Great Liceu Theater Society), organized in a similar way to a trading company or societat. This is reflected in the building's architecture; for example, there is no royal box.\n\nThe auditorium is huge. Rebuilt after the 1994 fire it is a faithful rebuilding of the 1861 auditorium with some improvements. With 2,292 seats it is one of the biggest opera houses in Europe. It is a typical Italian horseshoe-shaped theatre. Maximum length and width are 33 and 27 m. There is a platea (main floor) and five tiers (or balconies). Boxes, with small rooms attached, are in the forestage, in the platea and in the some of the galleries. There is no significant physical divisions among boxes: only a low screen separates one box from another. No columns are in the theatre apart from inside the platea giving the appearance of the galleries of a golden horseshoe without visual interruptions. Another peculiarity is in the first gallery where the amfiteatre ubicare is located. This is a projecting part of this gallery, with a less pronounced horseshoe shape, that allows three ranks of seats to be located there and are considered the best in the theatre.\n\nBuilding expenses were covered by the sale of boxes and seats. Boxes were lavishly decorated by their owners but all them disappeared in the 1994 fire. Upper balconies (4th and 5th tiers) are the cheapest seats and are is called the galliner (literally “henroost”).\n\nThe forestage, or proscenium, reproduces the old one which was rebuilt in 1909. It has a big central arch with two Corinthian columns on both sides and, among the columns, four tiers of boxes parapets with the wider and more luxurious boxes in the theatre being called banyeres (literally “bathtubs”).\n\nThe auditorium ornamentation reproduces that of 1909: sumptuous with golden and polychromed plaster moldings, as usual in 19th-century European theatres. Lamps are of brass and glass in the shape of a drake. Armchairs on the main floor are made of strained iron and red velvet.\n\nIn the rebuilding some modern features were introduced. The eight circular paintings in the roof, and the three in the forestage, were all lost in the fire and have been re-created by contemporary artist Perejaume. The stage curtain is a work of the Catalan designer Antoni Miró. The new hemispheric lamp in the center of the roof is a platform for technological facilities (lighting, sound and computer).\n\nOther technological facilities are control and projecting cabins in some balconies, a “technical floor” over the roof, and high-tech equipment to record and broadcast performances. With computerized cameras the auditorium could also be used as a television set. Stage facilities are among the most modern and allow quick scene changes and to perform four different sets simultaneously.\n\nA new foyer has been built under the main auditorium. It is a room where is the main bar and the restaurant are located and is used also to stage concerts, small format performances, lectures, cultural activities, and meetings etc.",
     "street":"Les Rambles, 51-59, 08002, Barcelona",
     "latitude":41.38025899792946,
     "longitude":2.1734128109756057,
     "foto-peq":"teatreLiceuSmall.jpeg",
     "foto-gran":"teatreLiceuBig.jpg",
     "color":"white",
     "squareX":0.0,
     "squareY":0.0,
     "offset":150.0
     },
     {"name":"Plaça de Toros Monumental",
     "description":"The Plaza Monumental de Barcelona, often known simply as La Monumental, is a bullring in the city of Barcelona, Catalonia, Spain. It was the last bullfighting arena in commercial operation in Catalonia. It was inaugurated in 1914 under the name Plaza de El Sport and was immediately expanded and renamed in 1916 with its current name. It is situated at the confluence of the Gran Via and Carrer Marina (Marina Street) in the Eixample district. It has a capacity of 19,582 within 26 rows of lines, boxes, and bleachers on the first floor inside and a superior barrage surrounding the building.\n\nIt was the last place in Catalonia where bullfights were held, since the Parliament of Catalonia passed a ban of bullfighting events on 28 July 2010 that came into force in 2012. Balanyà family property, which has transferred its operation to the House Matilla.\n\nThe building originally had a noucentista architectural style, the work of Manuel Joaquim Raspall i Mayol. The expansion work was done by Ignasi Mas i Morell and Domènec Sugrañes i Gras to give it its current facade, strongly influenced by Mudéjar and Byzantine architecture. It is one of the larger public arenas in Barcelona, with a capacity of 19,582 for bullfights or about 25,000 for events such as rock concerts (using part of the ring for spectators).",
     "street":"Gran Via de les Corts Catalanes, 749, 08013, Barcelona",
     "latitude":41.40006028047505,
     "longitude":2.1812316000000465,
     "foto-peq":"plazaMonumentalSmall.jpeg",
     "foto-gran":"plazaMonumentalBig.jpg",
     "color":"white",
     "squareX":20.0,
     "squareY":0.0,
     "offset":150.0
     },
     {"name":"Palau Güell",
     "description":"The Palau Güell is a mansion designed by the architect Antoni Gaudí for the industrial tycoon Eusebi Güell. It is situated in the Carrer Nou de la Rambla, in the El Raval neighbourhood of the city of Barcelona in Catalonia, Spain. It is part of the UNESCO World Heritage Site “Works of Antoni Gaudí”.\n\nThe home is centered on a main room for entertaining high society guests. Guests entered the home in horse-drawn carriages through the front iron gates, which featured a parabolic arch and intricate patterns of forged iron-work resembling seaweed and in some parts a horsewhip. Animals could be taken down a ramp and kept in the livery stable in the basement where the servants resided, while the guests went up the stairs to the receiving room. The ornate walls and ceilings of the receiving room disguised small viewing windows high on the walls where the owners of the home could view their guests from the upper floor and get a 'sneak peek' before greeting them, in case they needed to adjust their attire accordingly.\n\nThe main party room has a high ceiling with small holes near the top where lanterns were hung at night from the outside to give the appearance of a starlit sky.\n\nIn 2004, visits by the public were completely suspended due to renovations; some of the stone used in the original construction was weak and has cracked over the years causing structural problems within the building. As of 1 February 2008, Palau Güell was partially reopened to the public, with access to limited parts of the building only. It is currently completely open with all restoration work completed in April 2011.\n\nIt was used in Antonioni's film The Passenger as a backdrop for the first meeting between Jack Nicholson and Maria Schneider.",
     "street":"Carrer Nou de la Rambla, 3-5, 08001, Barcelona",
     "latitude":41.37886497391473,
     "longitude":2.1742398000000094,
     "foto-peq":"palauGuellSmall.jpeg",
     "foto-gran":"palauGuellBig.jpg",
     "color":"white",
     "squareX":20.0,
     "squareY":0.0,
     "offset":175.0
     },
     {"name":"Museu d'Història de Catalunya",
     "description":"The History Museum of Catalonia is located in the old building of Palau del Mar, former seat dedicated to the sea trade activity.\n\nIt is located at Passeig de Borbó Street, where you'll see the harbour and the mountain of Montjuïc as a background, as well as the beach of La Barceloneta extended at the very end of the avenue.\n\nThis seafront side of Barcelona is full of bars and restaurants, where you can taste the best fresh fish and seafood specialities.\n\nThis center is not dedicated to artworks, it does not contain any artistic piece. It is a fundamentally and educational museum, understandably explaining the history and origins of the Spanish region Catalonia, having Barcelona as the capital city.\n\nThe value of the museum is its historical content, we recommend a visit if you want to learn more about the history of Catalonia and come to a better understanding of our culture.\n\nIt has four floors organized chronologically, talking about of the past and present of Catalonia, from prehistory to the early 80s of the XX century. You will find here various objects, tools used by early settlers as well as reproductions of their houses and clothes, their way of life...documents and visual explanations of their culture.\n\nUndoubtedly, this is a very complete, very interesting and educational center, although it can be too specific. Their facilities are very large, so a complete visit will take you a while. Keep this in mind if you have short time during your stay Barcelona.",
     "street":"Palau de Mar, Plaça de Pau Vila, 3, 08003, Barcelona",
     "latitude":41.3807079757314,
     "longitude":2.1859830355820122,
     "foto-peq":"museuHistoriaSmall.jpeg",
     "foto-gran":"museuHistoriaBig.jpg",
     "color":"black",
     "squareX":0.0,
     "squareY":0.0,
     "offset":200.0
     },
     {"name":"Basílica de la Mercè",
     "description":"The Church is located in the Gothic Quarter of Barcelona.\n\nDedicated to the Virgin named la Mercè (patron saint of the Barcelona) and is one of the most representative churches of the city.\n\nIn the square where is located the monument (Plaça de la Mercè) stands a monumental fountain dating to the Eighteenth Century, with a central sculpture dedicated to the god Neptune.\n\nThe present church is a beautiful baroque church, built between 1765 and 1775 by the Catalan architect Josep Mas i Dordal.\n\nNo doubt this Barcelona basilica is notable for its monumentality, enhanced by the delicate rococo decoration, rich marble and stucco cladding decos.\n\nMany are the faithful devotees of the Church of  la Mercè, even football players from the FC Barcelona are often coming to the temple, to offer their triumphs to the Virgin and to sing a salve in her honour.",
     "street":"Carrer de la Mercè, 1, 08002, Barcelona",
     "latitude":41.37936959851642,
     "longitude":2.179547117791003,
     "foto-peq":"basilicaMerceSmall.jpeg",
     "foto-gran":"basilicaMerceBig.jpg",
     "color":"white",
     "squareX":25.0,
     "squareY":0.0,
     "offset":200.0
     },
     {"name":"Basílica de Santa Maria del Pi",
     "description":"Santa Maria del Pi is a 14th-century Gothic church in Barcelona, Catalonia, Spain. It is situated on the Plaça del Pi, in the Barri Gòtic district of the city.\n\nThere are unsubsantiated claims that there was an early Christian church on the site in 413. However it is known that in 987 there existed a church outside the city walls and to the west of Barcelona. This was a small Romanesque church dedicated to the Blessed Lady of the Pine Tree (one of the titles of the Virgin Mary). The church was built between 1319 and 1391. The style of the church was Catalan Gothic, with a single nave almost devoid of ornamentation. However in 1936 the church was gutted by a fire and was later restored.\n\nThe front facade has a large rose window, which is a faithful 1940 reproduction of the original window, which was destroyed in the fire of 1936. Below is the Gothic arch of the main entrance.\n\nThe tympanum of the main entrance is divided by two small columns into three arched areas. In the central area is a statue of the Virgin and Child, and above this are placed the arms of the city and of the parish.\n\nThe side facade has prominent buttresses that support the weight of the arches and vault of the nave. Between each pair of buttresses is a lancet window. In the centre of this facade is the Door of Avemaria.\n\nThe rear facade also has buttresses and lancet windows that light the semi-circular apse. At the rear of the apse there is an ancient door from 1578 that previously gave access to the church via the rear facade.\n\nOver the years the construction of neighbouring buildings has obscured the ancient walls of the church.\n\nThe bell tower is octagonal in shape, rising to 54 metres. The walls at the base are 3.55 metres thick. It has a peal of six bells, of which the largest is “Antònia”, which has a diameter of 1.4 metres and weighs 1,806 kilograms. Construction was started on the bell tower in 1379, under the instructions of the architect, Barthomeu Mas, and was completed in 1461, or thereabouts.\n\nThe floor plan of the church comprises a single nave made up of seven rectangular sections, each covered with a vaulted ceiling and with side-chapels placed between the supporting pillars. The interior length of the nave is 54 metres, the width is 16.5 metres and the height is 12.2 metres. The fire of 1936 destroyed the high altar, the altarpiece, the statues, the choir stalls from 1868 and the organ created in 1808 by Johan de Kyburz.\n\nThe high altar is made of alabaster and is the work of Joaquim de Ros i de Ramis. It was installed in 1967.\n\nIn the presbytery is a statue of Santa Maria del Pi, 3.3 metres high, created in 1973 by sculptor Enric Monjo.\n\nThe original Baroque choir stalls dated from 1771 and were designed by Josep Mas i Dordal. In 1868 these were replaced by neo-gothic stalls, which were destroyed in the fire of 1936. In 1986 the previous baroque stalls were re-instated.\n\nThe original stained-glass windows have not survived. The oldest of those that exist now date from 1718. Of these, the window depicting the Adoration of the Magi (above the Door of Avemaria) is the work of Antoni Viladomat.\n\nSaint Joseph Oriol, canonized in 1909, who was priest in this parish between 1687 and 1702, is buried in this church in the Chapel of the Virgin Mary of Montserrat.",
     "street":"Plaça del Pi, 7, 08002, Barcelona",
     "latitude":41.382148737464696,
     "longitude":2.1740199730163567,
     "foto-peq":"basilicaSMariaSmall.jpg",
     "foto-gran":"basilicaSantaMariaBig.jpg",
     "color":"white",
     "squareX":0.0,
     "squareY":0.0,
     "offset":200.0
     },
     {"name":"Museu d'Història de Barcelona",
     "description":"The Barcelona City History Museum (acronym MUHBA) is a city museum that conserves, researches, communicates and exhibits the historical heritage of the city of Barcelona, from its origins in Roman times until the present day; it is funded by the Barcelona municipality. The museum's headquarters are located on Plaça del Rei, in the Barcelona Gothic Quarter (Barri Gòtic). It is responsible for a number of historic sites around the city, most of them archaeological sites displaying remains of the ancient Roman city, called Barcino in Latin. Some others date to medieval times, including the Jewish quarter and the medieval royal palace called the Palau Reial Major. The rest are contemporary, among them old industrial buildings and sites related to Antoni Gaudí and the Spanish Civil War. The museum was inaugurated on 14 April 1943; its principal promoter and first director was the historian Agustí Duran i Sanpere.\n\nSince the 1888 Barcelona Universal Exposition there are recorded some attempts and projects in order to create a museum about the History of Barcelona.\n\nIn 1929 during the 1929 Barcelona International Exposition the municipality organized a temporary exhibition about Barcelona's past, present and future that constitutes the forerunner of the Barcelona City History Museum.\n\nIn 1931, Casa Padellàs (Padellas's house), a late gothic palace (15th-16th centuries) was moved stone by stone from its original location on Mercaders street to Plaça del Rei, in order to preserve it and to avoid its demolition because of the opening of Via Laietana, an avenue created to connect the new Barcelona Eixample with the port, crossing the old city.\n\nWhile rebuilding Casa Padellàs on its new location, some remains of the ancient city of Barcino (Latin name of Barcelona) were found. Immediately, an archaeological research was undertaken in the surrounding area, emerging a whole quarter of the Roman city. Spanish Civil War (1936-1939) stopped all, though the importance of the findings determined that there was the most fitting location for the historical museum planned since the 19th century, that then would largely become an archaeological museum.\n\nThe Barcelona City History Museum was finally inaugurated after Spanish Civil War, in 1943, under francoist regime. The core of the museum was then centered on the archaeological remains of the Roman and late antique city together with the medieval royal palace in Plaça del Rei (Palau Reial Major), which includes the main hall called Saló del Tinell (14th century) and the palatine chapel dedicated to Saint Agatha (14th century) with its gothic altarpiece, a work of the medieval painter Jaume Huguet (15th century). In the rebuilt Casa Padellàs rooms were also exhibited objects witnessing the history of Barcelona along late medieval and modern times, until 20th-century beginnings: the city government and its regulations, the guilds, civic celebrations, wars and conflicts, crafts and trade, the International Expositions held in Barcelona and the growing and transformations of the city in the industrial era, among other topics.\n\nGradually, the museum incorporated new sites like the Temple of Augustus or the Roman funeral way in Vila de Madrid square (found in 1954). The archaeological Plaça del Rei area also grew with new findings like the Early Christian baptistery (1968).\n\nAt the end of francoism, when democracy was recovered in Spain (particularly since 1979), the role of the museum was reconsidered. The permanent, static, exhibition about the history of Barcelona in Casa Padellàs rooms was closed (around 1990). Thus, since 1996, Casa Padellas rooms serve for temporary exhibitions that allow more dynamic overviews and crossed discussions about key subjects of Barcelona’s history. Simultaneously, the archaeological area was completely remodelled and its museography updated, incorporating recent knowledge about the city in Roman and late antique times (inaugurated 1998).\n\nAlong the last decades, MUHBA has also put the focus on contemporary history and has been growing as a network of heritage sites, tending to provide through them a more complete coverage over the History of Barcelona.\n\nSince 2005 MUHBA publishes the scientific magazine Quarhis (Quaderns d’Arqueologia i Història de la ciutat de Barcelona) as an updated resume of the former magazine Cuadernos de Arqueología e Historia de la Ciudad (1960-1980)\n\nMUHBA impulses a European network of city history museums and research centers on urban history (since 2010).",
     "street":"Plaça del Rei, s/n, 08002, Barcelona",
     "latitude":41.38397318794573,
     "longitude":2.1776337576720834,
     "foto-peq":"museuHistBcnSmall.jpeg",
     "foto-gran":"museuHistBcnBig.jpg",
     "color":"white",
     "squareX":0.0,
     "squareY":0.0,
     "offset":175.0
     },
     {"name":"Monestir de Pedralbes",
     "description":"The Monastery of Pedralbes is a Gothic monastery in Barcelona, Catalonia, Spain. It is now a museum, housing collections from Barcelona City's History Museum.\n\nThe monastery was founded by King James II of Aragon for his wife Elisenda de Montcada in 1326. It housed a community of Poor Clares, mostly members of noble families. The queen gave the monastery a series of privileges, including the direct protection of the city of Barcelona, through the Consell de Cent (“Council of the Hundred”), who had the task to defend it in case of danger. Elisenda also built a palace annexed to the monastery, where she lived after her husband's death in 1327. She died there in 1367. The remains of the palace were discovered in the 1970s.\n\nDuring the Catalan Revolt (1640), the nuns were expelled, but later returned. A small number of nuns still reside in the complex. The monastery was declared a national monument in 1991.\n\nOriginally the monastery (built in white stone, pertas albes in Catalan, whence its denomination) was defended by a line of walls, of which today only two towers and one gate remain.\n\nThe church has a single nave, with rib vaults and a polygonal apse, and houses a Gothic retablo by Jaume Huguet. The façade is characterized by a large rose window.\n\nThe cloister has three floors, and a length of 40 meters, with a central garden of orange trees and palms. It is formed by wide arches on columns, whose capitals are decorated with the emblems of the Kings of Aragon and the House of Montcada. The sepulchre of Queen Elisenda, in alabaster stone, is located in one of the cloister's wings.\n\nAlso notable is the Chapel of St. Michael, housing several fresco paintings by Ferrer Bassa. Dating to 1346, they show the influence of the Italian painter Giotto.\n\nThe former dormitory houses a permanent exhibition of painters such as Rubens, Canaletto, Tintoretto, Velázquez and Beato Angelico (Virgin of the Humility, one of his masterworks).",
     "street":"Baixada del Monestir, 9, 08034, Barcelona",
     "latitude":41.39514603821318,
     "longitude":2.1122417613769358,
     "foto-peq":"monestirPedrSmall.jpeg",
     "foto-gran":"monestirPedrBig.jpg",
     "color":"white",
     "squareX":25.0,
     "squareY":0.0,
     "offset":200.0
     },
     {"name":"Museu Marítim",
     "description":"The Museu Marítim (Maritime Museum) in Barcelona is certainly one of the most interesting sights. The museum is fitting in the former shipyards of Drasannes accommodated. The museum is located at the southern edge of the Old Town and at the end of the Rambla.\n\nIn the Drasannes were built in the 13 until 18 Century war and merchant ships  The construction of the shipyards was Barcelona's naval supremacy throughout the Mediterranean expansion. It could take up to 30 galleys simultaneously in the built vaults. From 1792, the Drassanes are used as barracks.\nSince 1929, the permanent exhibition is at the Maritime Museum and shows the maritime history of Catalonia, the museum moved in the Gothic building in 1936. In several steps then the buildings were restored, so that it now has an exhibition area of more than 10,000 sq metres.\n\nCertainly the highlights of the Maritime Museum exhibited include the vessels. Especially noteworthy is the faithful reproduction of a galley from the 16th Century. The 60-meter-long royal galley Admirals of the Juan de Austria was in the Battle of Lepanto on 7 October 1571 involved in which the Turkish Armada was defeated. On the galley rowed 236 people in 59 rowing boat.\n\nIn Port Vell, about 500 meters from the museum buildings, is the three-mast schooner Santa Eulàlia, which also can be viewed. This was launched in 1919 and is a typical merchant ship of that time.\n\nSeveral other boats of different categories, from simple wooden fishing boat to a wooden submarine to racing boats are issued.\n\nWith the same care and building technology as well as the big ships were built, one has even at times of the naval supremacy of Barcelona on the Mediterranean witnessed original models of ships. This happened e.g. for training and testing purposes. Most models of the collection were made in the 19th Century. Often the ships as originals no longer exist, so that the models provide valuable information on the design, technology and capacity of ships of all eras.\n\nThe Museu Marítim has a remarkable collection of navigational instruments, which are especially served for navigation. Most instruments are from the period of 18 to 20 Century and show the development of the sextant, depth gauge and many other navigational tools.\n\nThe Gallionsfiguren should have always been the safe sailing ships sail through the seas. The main part of the collection comes from Catalan sailing ships of the 19th Century.",
     "street":"Avinguda de les Drassanes, s/n, 08001, Barcelona",
     "latitude":41.3757351442651,
     "longitude":2.175545286508168,
     "foto-peq":"museoMarSmall.jpeg",
     "foto-gran":"museoMarBig.jpg",
     "color":"white",
     "squareX":25.0,
     "squareY":0.0,
     "offset":200.0
     },
     {"name":"Parc de Joan Miró",
     "description":"The Parc Joan Miró covers four blocks of the Barcelona road grid near the Plaça d'Espanya. The park is a popular area to relax. The park which is on one side of the road Carrer de Tarragona is also known as Parc de l'Escorxador which translates as Slaughterhouse Park as this was the previous use for the site.\n\nThe park is divided into two distinct areas. The lower area contains plants which includes flowers as well as eucalyptus, pine and palm trees. The higher area is paved and has an artificial lake from which the sculpture rises at one corner.\n\nDona i Ocell (English: Woman and Bird) is a 22-metre high sculpture by Joan Miró located in the park. The sculpture is part of an artwork trilogy commissioned from Miró to welcome visitors to Barcelona.\nThe concrete sculpture was formally opened in 1982 or 1983 (sources vary) and it was one of Joan Miró's last large sculptures which he constructed with the help of his friend and collaborator Joan Gardy Artigas. Miró was not able to attend the opening as he was too ill and he died less than a year later.\nIt was Miró's design but Artigas was responsible for adding the tiles as he had done for Miró's earlier mural in Ludwigshafen, Germany. Dona i Ocell was part a publicly commissioned trilogy that was intended to welcome visitors to Barcelona as they arrived by the sea, from the air or in this case by land. Miró had been born in the city in 1893 and he was a champion for Catalonian culture. Car passengers that arrive in Barcelona can see the strong colours of the tiles which are indicative of Miró's style. This work was the last of the three sculptures that welcomed Barcelona's tourists. The first was at the airport and it was commissioned in 1968. The intermediate work was a large mosaic in La Rambla in Barcelona.\n\nThe work uses some of Miró's recurring themes of women and birds. In Catalan the word for a “bird” is a term for a penis. This is reflected in the phallic shape of the main form which has a hole through the glans. The sculpture is decorated in primary colours and it has a vulva shaped split down the side of the shaft which is lined with blackish tiles. The idea for the sculpture is not new and examples of placing vulva on a model penis and a hole in the glans have been found on Roman sculpture from the second or third century.",
     "street":"Carrer d'Aragó, 2, 08015, Barcelona",
     "latitude":41.378029212391986,
     "longitude":2.1484324594939608,
     "foto-peq":"parcJoanMiroSmall.jpeg",
     "foto-gran":"parcJoanMiroBig.jpg",
     "color":"white",
     "squareX":0.0,
     "squareY":0.0,
     "offset":200.0
     },
     {"name":"Parc del Fòrum",
     "description":"The Forum Building, also known as Museu Blau de les Ciències Naturals, is an architectural landmark in Barcelona designed by the Swiss architects Jacques Herzog and Pierre de Meuron (Herzog & de Meuron).\n\nThe building is triangular in shape, measuring 180 metres on each side and 25 metres in height, located within the triangle formed by Diagonal Avenue, Rambla de Prim and the Ronda Litoral.\n\nIt was the symbol of the controversial 2004 Universal Forum of Cultures and the serious flaws that arose during its construction were widely covered in both the Spanish national and foreign press.[1] The building has become a political bone of contention, with the opposition parties in both Barcelona Council and the Parliament of Catalonia demanding to know why it cost so much (of the order of US $144 m).\n\nThe building has an auditorium with a seating capacity of 3,200 and an exhibition hall covering nearly 5,000 square metres.",
     "street":"Plaça Leonardo da Vinci, s/n, 08901, Barcelona",
     "latitude":41.411329124147336,
     "longitude":2.2200002037047852,
     "foto-peq":"parcForumSmall.jpeg",
     "foto-gran":"parcForumBig.jpg",
     "color":"white",
     "squareX":0.0,
     "squareY":0.0,
     "offset":200.0
     }
     ]
}